module Admin
  class NewsController < ApplicationController
    before_action :authorize
    before_action :require_role
    layout 'application_admin'

    def index
      @news = News.all.order(updated_at: :desc)

      @test_m = [
          ["Мережа лікувально-профілактичних закладів Вінницької області ","","","","","","","","",""  ],
          ["м.Вінниця","","","","","","","","",""  ],
          ["Міські заклади","","","","","","","","",""  ],
          ["№ п/п","Назва медичної установи","Адреса","Контактні телефони","Головний лікар","Електронна пошта","Ліцензія на право здійснювати медичну діяльність","","","Категорія"  ],
          ["","","","","","","Термін дії ліцензії з","№ ліцензії серія","Термін дії акредита-ційного сертифіката по",""  ],
          ["1","Міська клінічна лікарня №1","21029, м.Вінниця, вул.Хмельницьке шосе,96","(0432) 51-12-31","Турський Олександр Феодосійович","vinmkl1@ukr.net","21.07.2011","АГ №602633","23.09.2016","вища"  ],
          ["2","Міська клінічна лікарня швидкої медичної допомоги ","21032, м.Вінниця,вул.Київська, 68","(0432) 66-53-39","Фомін Олександр Олександрович","mkl2schmd@ukr.net","21.06.2012","АГ №600562","14.08.2016","вища"  ],
          ["3","Міська клінічна лікарня №3","21019 м.Вінниця вул Маяковського, 138","(0432) 60-58-12","Фостаковський Дмитро Стефанович","sekretar@mkl3.vn.ua    kadri@mkl3.vn.ua","20.09.2012","АД №063222","","перша"  ],
          ["4","Міська лікарня \"Центр матері та дитини\"","21019  м.Вінниця  вул . Маяковського, 138","(0432) 68-70-10","Присяжнюк Володимир Петрович","micentr@ukr.net","22.03.2012","АГ №598516","24.07..2018","вища"  ],
          ["5","Вінницький міський клінічний пологовий будинок №1","21029, м.Вінниця вул.Хмельницьке шосе 98","(0432) 51-11-08","Коваленко Віктор Степанович","polbud1@ukr.net","27.12.2012","АЕ №196786","14.08.2016","вища"  ],
          ["6","КЗ \"Вінницький міський клінічний  пологовий будинок №2\"","21001, м. Вінниця пр-т. Коцюбинського, 50","(0432) 27-25-24","Фесун Анатолій Григорович","roddom@svitonline.com","14.06.2012","АД №071050","14.08.2016","вища"  ],
          ["7","Міське комунальне підприємство \"Медичний стоматологічний центр\" ","21021 Вінницька обл. м.Вінниця, вул. Келецька, 68","(0432) 55-11-48","Цибулюк Андрій Якович","spvmksc@ukr.net","15.08.2013","АЕ №281292","20.03.2009","вища"  ],
          ["8","КЗ \"Міська клінічна стоматологічна поліклініка\"","21050 м.Вінниця, вул.Архитектора Артинова,24","(0432) 35-82-88","Герасимчук Валентина Василівна","VMKDSP@ukr.net","03.04.2014","АЕ №450124","26.10.2012","вища"  ],
          ["9","КП \"Міський лікувально-діагностичний Центр\"","21032, Вінницька обл. м.Вінниця вул.Київська,68","(0432) 66-47-86","Бланар Оксана Леонідівна","сmdc@ukr.net","07.11.2013","АЕ №281715","",""  ],
          ["10","Вінницька міська станція швидкої медичної допомоги","21009 м.Вінниця, вул.Ширшова,43","(0432) 27-43-33","Шиш Олександр Володимирович","vin03@ukr.net","20.06.2013","АЕ №197224","18.06.2013","вища"  ],
          ["11"," ЦПМСД №1","21011 Вінницька обл. м. Вінниця  вул. Пархоменко,13","(0432) 66-80-16","Фіщенко Людмила Володимирівна","cpmsd1-vn@ukr.net  (секретар)","17.04.2014","АЕ №459863","",""  ],
          ["12"," ЦПМСД №2","21050, м. Вінниця, вул. Першотравнева , б.44","(0432) 67-06-81","Кривов'яз Тамара Миколаївна","kz.cpmsd2@ukr.net      відділ кадрів:   szvyagin20@gmail.com","12.07.2012","АГ №600941","17.02.2018","вища"  ],
          ["13"," ЦПМСД №3","21029, м. Вінниця вул. Хмельницьке шосе, 96","(0432) 46-74-19","Малик Тетяна Анатоліївна","vincpmsd3@ukr.net","25.10.2012","АД №071373","23.01.2018","вища"  ],
          ["14","ЦПМСД №5","21001, м. Вінниця вул. 50 - річчя Перемоги, 49","(0432) 27-58-76","Роман Наталя Іванівна","cpmsd5vin@ukr.net","15.11.2012","АД №071404","",""  ],
          ["15","ЦПМСД №6","21009 м.Вінниця  вул. 50 р. Перемоги, 18","(0432) 55-21-33","Семерук Наталія Олексіївна","mpmv3@vinnitsa.com","27.06.2012","АГ №600831","",""  ],
          ["16","Вінницький регіональний Центр серцево-судинної патології","21029, м.Вінниця, вул.Хмельницьке шосе,96","(0432) 46-55-47","Данильчук Ігор Віталієвич","stat.card.c@ukr.net","","","",""  ],
          ["Обласні заклади","","","","","","","","",""  ],
          ["№ п/п","Назва медичної установи","Адреса","Контактні телефони","Головний лікар","Електронна пошта","Ліцензія на право здійснювати медичну діяльність","","","Категорія"  ],
          ["","","","","","","Термін дії ліцензії з","№ ліцензії серія","Термін дії акредитаційного сертифіката по",""  ],
          ["1","Вінницька обласна клінічна лікарня ім. М.І. Пирогова","21018 м. Вінниця, вул. Пирогова, 46","(0432) 35-31-85","Жупанов Олександр Борисович","VOKLIP@gmail.com","16.06.2010","АВ №554131","25.12.2017","вища"  ],
          ["2","Вінницька обласна дитяча клінічна лікарня","м.Вінниця вул. Хмельницьке шосе,108","0(432) 55-20-07","Паненко Василь Васильович","kadry_vodkl555@ukr.net","21.04.2011","АГ №601319","17.07.2018","вища"  ],
          ["3","КЗ \"Вінницька обласна психоневрологічна лікарня ім.. акад. О.І Ющенка \" ","21005  м.Вінниця вул. Пирогова 109","(0432) 50-79-00","Клочко Вадим Леонідович","VPByust@ukr.net; kadruVOPNL@ukr.net","07.11.2011","АГ №603725","29.01.2018","вища"  ],
          ["4","КЗ ","","","","","","","",""  ],
          ["Соціотерапія\","," м.Вінниця вул. Пирогова"," 109-В\"","(0432) 53-50-11","Слободянюк Павло Михайлович","oblnarko@ukr.net","18.07.2013","АЕ №281176","","перша"  ],
          ["5","Вінницький обласний клінічний онкологічний диспансер","21029, м.Вінниця, Хмельницьке шосе,84","(0432) 43-55-88","Шамрай Володимир Анатолійович","nataonko@mail.ru","21.04.2011","АГ №601084","26.09.2016","вища"  ],
          ["6","Вінницький обласний клінічний шкірно-венерологічний диспансер","21050, Вінницька обл., м.Вінниця, вул. Першотравнева,  21","(0432) 67-12-88","Бардашевський Олег Борисович","oshv_d@ukr.net","10.01.2012","АГ №597157","20.07.2015","перша"  ],
          ["7","Вінницький обласний клінічний високоспеціалізований ендокринологічний центр","21010 Вінницька обл., м.Вінниця , вул. Мічуріна  32","(0432) 61-17-36","Прудиус Пилип Григорович","endo@ukr.net","26.05.2011","АЕ №282116","24.12.2016","вища"  ],
          ["8","Вінницький обласний спеціалізований клінічний диспансер радіаційного захисту населення","21018 Вінницька обл., м. Вінниця, вул. В. Стуса, 11","(0432) 35-13-14","Даценко Василь Григорович","voskdrzn@ukrpost.ua","14.11.2011","АГ №603902","29.01.2018","вища"  ],
          ["9","Вінницький обласний клінічний госпіталь для інвалідів Вітчизняної війни","21005, м.Вінниця, вул. Пирогова, 109-А","(0432) 68-22-92","Бабійчук Валерій Вікторович","vinogiv@ukr.net","31.03.2011","АГ №570946","25.12.2017","вища"  ],
          ["10","Вінницький обласний лікарсько-фізкультурний диспансер","21050 м.Вінниця вул. Грушевського,2","(0432) 35-22-96","Чернишук Сергій Никифорович","fizdispanser@ukr.net","10.02.2011","АГ №570232","",""  ],
          ["11","Вінницька обласна дитяча інфекційна лікарня","21032 Вінницька обл., м.Вінниця, вул.Київська,68","(0432) 66-62-80","Бронівська Людмила Миколаївна","vocdil@ukr.net","14.07.2013","АЕ №281015","25.05.2018","перша"  ],
          ["12","КУ  ","","","","","","","",""  ],
          ["об'єднання \"Вінницький обласний Центр екстреної медичної допомоги та медицини катастроф\"\"","21018, Вінницька область, м.Вінниця, вул. Пирогова 46 А","(0432) 50-84-73","Пірникоза Анатолій Васильович","med_katastrof@ukr.net","25.07.2013","АЕ №197450","","",""  ],
          ["Барський район","","","","","","","","",""  ],
          ["№ п/п","Назва медичної установи","Адреса","Контактні телефони","Головний лікар","Електронна пошта","Ліцензія на право здійснювати медичну діяльність","","","Категорія"  ],
          ["","","","","","","Термін дії ліцензії з","№ ліцензії серія","Термін дії акредитаційного сертифіката по",""  ],
          ["1","Барська центральна районна лікарня","23000 Вінницька обл., Барський р - н., м. Бар вул. Рози Люксембург № 34","(04341) 2-25-45","Костенко Олександр Сергійович","barlikarnya@rambler.ru","26.05.2011","АГ №601615","14.08.2016","перша"  ],
          ["2","Барський центр первинної медико-санітарної допомоги","23000 Вінницька обл., Барський р - н., м. Бар вул. Рози Люксембург № 34","(04341) 2-21-60","Капиця Володимир Миколайович","barmedcentr@ukr.net","31.05.2012","АГ №600428","27.11.2017","друга"  ],
          ["3","Барська районна стоматологічна поліклініка","23000 м. Бар , вул. Нахімова. 21","(04341) 2-20-17","Попель Григорій Петрович","barstom@ukr.net","31.05.2012","АГ №600378","22.11.2016","перша"  ],
          ["4","КЗ \"Барська обласна туберкульозна лікарня\"","23000 м.Бар  Вінницька обл. вул.Рози Люксембург, 5 А","(04341) 2-14-50","Вознюк Ганна Іванівна","bar_tub@ukr.net","14.03.2014","АЕ №283355","","перша"  ],
          ["Бершадський район","","","","","","","","",""  ],
          ["№ п/п","Назва медичної установи","Адреса","Контактні телефони","Головний лікар","Електронна пошта","Ліцензія на право здійснювати медичну діяльність","","","Категорія"  ],
          ["","","","","","","Термін дії ліцензії з","№ ліцензії серія","Термін дії акредитаційного сертифіката по",""  ],
          ["1","Бершадська окружна лікарня інтенсивного лікування","24400, Вінницька область,  м.Бершадь,вул. Будкевича 2","(04352) 2-39-01","Залецький Василь Анатолійович","bershad_olil@ukr.net","18.08.2011","АЕ №283014","17.02.2018","вища"  ],
          ["2","Бершадський центр первинної медико-санітарної допомоги","24400, Вінницька область, м.Бершадь, вул. Будкевича,2","(04352) 2-41-02","Брикуля Лілія Іванівна","kubrcpmsd@ukr.net","16.02.2012","АГ №597691","26.08.2017","перша"  ],
          ["3","Бершадська станція швидкої медичної допомоги","24400, Вінницька обл. Бершадський р-н м. Бершадь вул. Будкевича 2-А","(04352) 2-22-47","Заболотний Михайло Станіславович","bershmd2013@ukr.net","готують документи для подачі в МОЗ","","",""  ],
          ["Вінницький район","","","","","","","","",""  ],
          ["№ п/п","Назва медичної установи","Адреса","Контактні телефони","Головний лікар","Електронна пошта","Ліцензія на право здійснювати медичну діяльність","","","Категорія"  ],
          ["","","","","","","Термін дії ліцензії з","№ ліцензії серія","Термін дії акредитаційного сертифіката по",""  ],
          ["1","Вінницька центральна районна лікарня","21029 м.Вінниця Хмельницьке шосе,92","(0432) 51-12-88","Кривов'яз Олександр Леонідович","vinrtmo65@ukr.net","24.05.2012","АГ №600197","18.12.2014","вища"  ],
          ["2","Вінницький центр первинної медико-санітарної допомоги","21029 Вінницька область м.Вінниця Хмельницьке шосе,92","(0432) 51-11-89","Шеремета Юрій Петрович","vinmedrc@ukr.net","23.08.2012","АД №063070","26.06.2018","друга"  ],
          ["3","Вінницька обласна психіатрична лікарня №2","23222, с-ще Березина, Медмістечко, Вінницький район, Вінницька область","(0432) 56-63-44","Сокур Михайло Іванович","vopl2@i.ua","17.01.2013","АЕ №196815","18.06.2018","вища"  ],
          ["4","Вінницьке обласне спеціалізоване територіальне медичне об'єднання \"Фтизіатрія\"","23233, Вінницька обл., Вінницький р-н, с.Бохоники, комплекс будівель та споруд, буд. б/н","(0432) 56-66-45","Служивий Олександр Петрович","obltub@vinnitsa.com","25.07.2013","АЕ №197463","27.06.2015","вища"  ],
          ["5","КО \"Вінницький обласний Центр  профілактики та боротьби зі  СНІДом\"","23222, с. Березина \"Медмістечко\" , 5 км Барського шосе, Вінницька обл.","(0432) 56-64-05","Матковський Ігор Анатолійович","aids.center.vin@ukr.net","20.05.2010","АВ №539698","29.01.2018","вища"  ],
          ["6","КЗ \"Вінницький обласний протитуберкульозний диспансер №2\"","21010 Вінницька обл. м. Вінниця, вул. Мічуріна 34","(0432) 35-16-72","Богачук Микола Костянтинович","voptd2@ukr.net","17.05.2012","АД №071049","25.03.2017","перша"  ],
          ["Гайсинський район","","","","","","","","",""  ],
          ["№ п/п","Назва медичної установи","Адреса","Контактні телефони","Головний лікар","Електронна пошта","Ліцензія на право здійснювати медичну діяльність","","","Категорія"  ],
          ["","","","","","","Термін дії ліцензії з","№ ліцензії серія","Термін дії акредитаційного сертифіката по",""  ],
          ["1","Гайсинська центральна районна лікарня","23700 Вінницька обл. м. Гайсин вул. Гурвіча 1","(04334) 2-50-59","Кохан Ігор Васильович","gaysin_tmo@mail.ru","23.06.2011","АГ №602002","14.08.2013","вища"  ],
          ["2","Гайсинський  центр первинної медико-санітарної допомоги","Вінницька область, Гайсинський район, м.Гайсин, вул.Гурвіча,1   23700","(04334) 2-53-52","Кацан Тетяна Миколаївна","gaysincentr@ukr.net","19.04.2012","АГ №598378","26.08.2017","друга"  ],
          ["3","Гайсинська станція швидкої медичної допомоги","23700, Вінницька обл., Гайсинський р-н, м. Гайсин, вул. Гурвіча, 1 а","(04334) 2-31-07","Звенігородський Юрій Володимрович","gaysin аmbulance@ukr.net","30.10.2014","АЕ №571616","",""  ],
          ["Жмеринський район","","","","","","","","",""  ],
          ["№ п/п","Назва медичної установи","Адреса","Контактні телефони","Головний лікар","Електронна пошта","Ліцензія на право здійснювати медичну діяльність","","","Категорія"  ],
          ["","","","","","","Термін дії ліцензії з","№ ліцензії серія","Термін дії акредитаційного сертифіката по",""  ],
          ["1","Жмеринська центральна районна лікарня","23100 м. Жмеринка, вулиця Київська 288","(04332) 2-15-15","Боровський Ростислав Васильович","zhcrl@ukr.net","10.01.2012","АГ №597447","23.09.2016","вища"  ],
          ["2"," Жмеринський центр первинної медико-санітарної допомоги","23108 Вінницька область, Жмеринський район, село Леляки","(04332) 2-06-58","Калінський Олег Ігорович","vin_zhmerinka_cpmsd@ukr.net","27.06.2012","АГ №601000","18.12.2017","друга"  ],
          ["3","Жмеринська  районна стоматологічна поліклінніка","23100, Вінницька обл., Жмеринський р-н, м. Жмеринка, вул.Б.Хмельницького, 40","(04332) 5-07-38","Гаврилюк Василь Васильович","Zmerstom@ukr.net","05.02.2015","АЕ №638249","26.10.2012","вища"  ],
          ["4","Жмеринська міська станція швидкої медичної допомоги","23100 м. Жмеринка, вул. Центральна 26","(04332) 2-19-63","Кузьміна Тетяна Федорівна","zmerinka103@ukr.net","23.06.2011","АГ №602294","18.06.2016","перша"  ],
          ["Іллінецький район","","","","","","","","",""  ],
          ["№ п/п","Назва медичної установи","Адреса","Контактні телефони","Головний лікар","Електронна пошта","Ліцензія на право здійснювати медичну діяльність","","","Категорія"  ],
          ["","","","","","","Термін дії ліцензії з","№ ліцензії серія","Термін дії акредитаційного сертифіката по",""  ],
          ["1","Ілінецька центральна районна лікарня","22700 Вінницька обл. м.Іллінці вул.  Енгельса, 48","(04345) 2-11-47","Насушний Віктор Олександрович","rtmo@ukrpost.ua","10.01.2012","АГ №597688","14.08.2016","вища"  ],
          ["2","Ілінецький центр первинної медико-санітарної допомоги","22700, Вінницька область, м. Іллінці вул. Енгельса 48","(04345) 2-36-33","Атаманюк Олександр Єнісеєвич","illincyZPMSD@mail.ru","24.05.2012","АГ №600098","17.02.2018","друга"  ],
          ["Калинівський район","","","","","","","","",""  ],
          ["№ п/п","Назва медичної установи","Адреса","Контактні телефони","Головний лікар","Електронна пошта","Ліцензія на право здійснювати медичну діяльність","","","Категорія"  ],
          ["","","","","","","Термін дії ліцензії з","№ ліцензії серія","Термін дії акредитаційного сертифіката по",""  ],
          ["1","Калинівська центральна районна лікарня","22400,  Вінницька область   м.Калинівка, вул.Чкалова,6","(04333) 2-20-61","Костюк Володимир Григорович","kalinzrl@ukr.net","04.08.2011","АГ №602742","18.12.2017","перша"  ],
          ["2","Калинівський центр первинної медико-санітарної допомоги","22400, Вінницька область, Калинівський район, місто Калинівка, вул. Чкалова, 6","(04333) 4-11-61","Македонський Василь Антонович","kalin_medcentr@ukr.net","26.12.2011","АГ №599803","27.11.2017","перша"  ],
          ["Козятинський район","","","","","","","","",""  ],
          ["№ п/п","Назва медичної установи","Адреса","Контактні телефони","Головний лікар","Електронна пошта","Ліцензія на право здійснювати медичну діяльність","","","Категорія"  ],
          ["","","","","","","Термін дії ліцензії з","№ ліцензії серія","Термін дії акредитаційного сертифіката по",""  ],
          ["1","Козятинська центральна районна лікарня","22100 Вінницька обл.  м.Козятин вул. Червоноармійська 75","(04342) 2-25-05","Гуцол Володимир Григорович","koztermed@ukrpost.ua    kadry_kcrl@ukr.net","06.11.2014","АЕ №571565","20.12.2016","вища"  ],
          ["2","Козятинський центр первинної медико-санітарної допомоги","22100, Вінницька обл. м.Козятин, вул.Червоноармійська,28","(04342) 2-50-84","Дзема Олександр Іванович","kazatin_pmsd@ukr.net","03.06.2010","АВ №554244","",""  ],
          ["3","Козятинська районна стоматологічна поліклініка","22100 Вінницька обл. Козятинський район, м.Козятин вул. Червоноармійська,28","(04342) 2-29-27","Медушевська Любов Григорівна","stomatpoliklinika08@mail.ru","16.04.2015","АЕ №638567","14.08.2016","перша"  ],
          ["4","КЗ \"Козятинська обласна туберкульозна лікарня\"","22140 Вінницька обл. Козятинський р-н с.Сестринівка ","(04342) 2-04-90","Купчик Володимир Миколайович","sestrtub@ukr.net","08.01.2014","АЕ №282211","26.06.2018","перша"  ],
          ["Крижопільський район","","","","","","","","",""  ],
          ["№ п/п","Назва медичної установи","Адреса","Контактні телефони","Головний лікар","Електронна пошта","Ліцензія на право здійснювати медичну діяльність","","","Категорія"  ],
          ["","","","","","","Термін дії ліцензії з","№ ліцензії серія","Термін дії акредитаційного сертифіката по",""  ],
          ["1","Крижопільська окружна лікарня інтенсивного лікування","24600 Вінницька обл., Крижопільський район, смт.Крижопіль вул.9 січня,10","(04340) 2-25-83","Рузяк Валерій Іванович","kryzhopol_olil@ukr.net","21.06.2012","АЕ №283291","26.06.2018","вища"  ],
          ["2","Крижопільський центр первинної медико-санітарної допомоги","24600 Вінницька обл.Крижопільський р-н смт. Крижопіль вул. 9-Січня 6","(04340) 2-38-05","Килімник Леся Анатоліївна","kryz.centr@gmail.com","02.08.2012","АД №064367","27.11.2017","перша"  ],
          ["3","КО \"Обласний комунальний заклад Крижопільська туберкульозна лікарня\"","24600, Вінницька обл. Крижопіль вул.Театральна 18","(04340) 2-34-78","Мурзак Валентина Федорівна","tublic24600@ukr.net","19.12.2013","АЕ №282016","24.07.2018","перша"  ],
          ["Липовецький район","","","","","","","","",""  ],
          ["№ п/п","Назва медичної установи","Адреса","Контактні телефони","Головний лікар","Електронна пошта","Ліцензія на право здійснювати медичну діяльність","","","Категорія"  ],
          ["","","","","","","Термін дії ліцензії з","№ ліцензії серія","Термін дії акредитаційного сертифіката по",""  ],
          ["1","Липовецька центральна районна лікарня","22500, Вінницька область, Липовецький район,  м. Липовець, вул. Пірогова 9","(04358) 2-12-67","Дмитрук Олександр Михайлович","crl_lipov@ukrpost.ua, kadry_lip_crl@i.ua","18.08.2011","АГ №603264","","перша"  ],
          ["2","Липовецький центр первинної медико-санітарної допомоги","22500 Віницька область, м. Липовець, вул. Пирогова, 9","(04358) 2-24-21","Казімірко Аделя Нестерівна","lipov_cpmsd@ukr.net","25.10.2012","АД №071366","23.04.2018","друга"  ],
          ["3","Липовецька обласна лікарня відновного лікування дітей з органічним ураженням центральної нервової системи, порушенням психіки і опорно-рухового апарату","22500, Вінницька обл. Липовецький р-н  м.Липовець вул. Пирогова 36","(04358) 2-13-85","Стецюк Людмила Миколаївна","doctor_lipov@ukrpost.ua","30.09.2011","АГ №603333","23.04.2018","перша"  ],
          ["Літинський район","","","","","","","","",""  ],
          ["№ п/п","Назва медичної установи","Адреса","Контактні телефони","Головний лікар","Електронна пошта","Ліцензія на право здійснювати медичну діяльність","","","Категорія"  ],
          ["","","","","","","Термін дії ліцензії з","№ ліцензії серія","Термін дії акредитаційного сертифіката по",""  ],
          ["1","Літинська центральна районна лікарня","22300 Вінницька обл. смт.Літин вул.Пирогова,17","(04347) 2-12-51","Кобель Сергій Ульянович","litin-rtmo@ukr.net","21.11.2011","АГ №603972","14.08.2016","перша"  ],
          ["2","Літинський центр первинної медико-санітарної допомоги","22300, ВІнницька область Літинський район смт. Літин вул. Пирогова 17","(04347) 2-16-85","Дяченко Павліна Андріївна","litin_cpmsd@ukr.net","29.03.2012","АГ №598817","18.12.2017","друга"  ],
          ["Могилів-Подільський район","","","","","","","","",""  ],
          ["№ п/п","Назва медичної установи","Адреса","Контактні телефони","Головний лікар","Електронна пошта","Ліцензія на право здійснювати медичну діяльність","","","Категорія"  ],
          ["","","","","","","Термін дії ліцензії з","№ ліцензії серія","Термін дії акредитаційного сертифіката по",""  ],
          ["1","Могилів-Подільська окружна лікарня інтенсивного лікування","24000,  м. Могилів-Подільський, вул.Полтавська 89/2","(04337) 6-53-25","Миколюк Василь Васильович","mtmo-mogpod@mail.ru","17.10.2011","АЕ №282262","23.01.2015","вища"  ],
          ["2","Могилів-Подільський районний центр первинної медико-санітарної допомоги","24000, вул. В Стуса, 54/7","(04337) 6-36-90","Манжурова Олена Володимирівна","mogpod_cpmsd@hotmail.com","06.09.2012","АД №063373","23.01.2018","друга"  ],
          ["3","Могилів-Подільський міський центр первинної медико-санітарної допомоги","24000,Вінницька обл. м.Могилів-Подільський вул.В.Стуса 54/7","(04337) 6-36-68","Череватова Наталя Павлівна","vin.mogpod.mcpmsd@mail.ru","11.04.2013","АЕ №197664","28.05.2018","вища"  ],
          ["4","КЗ \"Могилів-Подільська обласна туберкульозна лікарня\"","24000 Вінницька обл., м.Могилів-Подільський, просп. Незалежності,62","(04337) 6-50-42","Цендра Анатолій Станіславович","mog-pod_otl@mail.ru","14.03.2014","АЕ №283331","30.01.2016","перша"  ],
          ["5","Могилів-Подільська міська стоматологічна поліклініка","24000, м. Могилів-Подільський вул. Київська, 44","(04337) 6-49-63","Соколовська Галина Григорівна","stomat_moq-pod@ukr.net, stomatmogpod44","11.11.2010","АВ №567747","20.12.2016","перша"  ],
          ["6","Могилів-Подільська станція швидкої медичної допомоги","24001, Вінницька обл. м. Могилів-Подільський вул. Полтавська, 89/2","(04337) 6-41-25","Блощинська Людмила Михайлівна","sshmd@mail.ru","19.02.2015","АЕ №638371","",""  ],
          ["Муровано-Куриловецький район","","","","","","","","",""  ],
          ["№ п/п","Назва медичної установи","Адреса","Контактні телефони","Головний лікар","Електронна пошта","Ліцензія на право здійснювати медичну діяльність","","","Категорія"  ],
          ["","","","","","","Термін дії ліцензії з","№ ліцензії серія","Термін дії акредитаційного сертифіката по",""  ],
          ["1","Муровано-Куриловецька лікарня планового лікування","23400 Вінницька обл. Мурованокуриловецький р-н, смт.Муровані Курилівці   вул.Жовтнева,87","(04356) 2-10-02","Олійник Мирослав Вікторович","murkur_lpl@ukr.net","01.03.2012","АЕ №281797","23.01.2018","друга"  ],
          ["2","Муровано-Куриловецький центр первинної медико-санітарної допомоги","23400 Вінницька область Мурованокуриловецький район вул. Жовтнева,87","(04356) 2-17-72","Сидоренко Лариса Генріхівна","vin_murkur_cpmsd@ukr.net","15.11.2012","АД №071346","23.01.2018","перша"  ],
          ["Немирівський район","","","","","","","","",""  ],
          ["№ п/п","Назва медичної установи","Адреса","Контактні телефони","Головний лікар","Електронна пошта","Ліцензія на право здійснювати медичну діяльність","","","Категорія"  ],
          ["","","","","","","Термін дії ліцензії з","№ ліцензії серія","Термін дії акредитаційного сертифіката по",""  ],
          ["1","Немирівська центральна районна лікарня","22800 Вінницька область м. Немирів, вул. Євдокименко, 21","(04331) 2-27-48","Юрець Сергій Єлисеєвич","crl_nem@ukrpost.ua, kadru_nem@meta.ua","04.07.2012","АД №063703","14.08.2016","вища"  ],
          ["2","Немирівський центр первинної медико-санітарної допомоги","22800 Вінницька область м. Немирів, вул. Євдокименко, 21","(04331) 2-19-65","Герасименко Леонід Михайлович","vinnemirovcpmsd@ukr.net    kadru_nemirov@ukr.net","24.05.2012","АГ №600338","26.08.2017","друга"  ],
          ["Оратівський район","","","","","","","","",""  ],
          ["№ п/п","Назва медичної установи","Адреса","Контактні телефони","Головний лікар","Електронна пошта","Ліцензія на право здійснювати медичну діяльність","","","Категорія"  ],
          ["","","","","","","Термін дії ліцензії з","№ ліцензії серія","Термін дії акредитаційного сертифіката по",""  ],
          ["1","Оратівська центральна районна лікарня","22600    ВІнницька обл. смт.Оратів  вул.Пирогова 2","(04330) 2-12-47","Садик Микола Іванович","orativ crl@ukrpost.ua","01.03.2012","АГ №59718","23.09.2016","перша"  ],
          ["2","Оратівський центр первинної медико-санітарної допомоги","22600,  Вінницька область, Оратівський район, смтОратів вул.Пирогова 2","(04330) 2-13-47","Якимович Ігор Васильович","orativ_centr@i.ua","05.12.2011","АГ №599457","23.01.2018","друга"  ],
          ["Піщанський район","","","","","","","","",""  ],
          ["№ п/п","Назва медичної установи","Адреса","Контактні телефони","Головний лікар","Електронна пошта","Ліцензія на право здійснювати медичну діяльність","","","Категорія"  ],
          ["","","","","","","Термін дії ліцензії з","№ ліцензії серія","Термін дії акредитаційного сертифіката по",""  ],
          ["1","Піщанська лікарня планового лікування","24700 Вінницька обл. Піщанський район смт.Піщанка вул.Леніна, буд.42","(04349) 2-12-02","Березюк Людмила Іванівна","likarnya_pis@ukrpost.ua","01.03.2012","АЕ №281798","23.01.2018","друга"  ],
          ["2","Піщанський центр первинної медико-санітарної допомоги","Вінницька область, Піщанський район, смт. Піщанка, вул. Леніна,42,  індекс 24700","(04349) 2-24-50","Руденко Володимир Степанович","centrmedpis@mail.ru","15.03.2012","АГ №597945","26.08.2017","друга"  ],
          ["Погребищенський район","","","","","","","","",""  ],
          ["№ п/п","Назва медичної установи","Адреса","Контактні телефони","Головний лікар","Електронна пошта","Ліцензія на право здійснювати медичну діяльність","","","Категорія"  ],
          ["","","","","","","Термін дії ліцензії з","№ ліцензії серія","Термін дії акредитаційного сертифіката по",""  ],
          ["1","Погребищенська центральна районна лікарня","22200, Вінницька обл., м.Погребище, вул.Павла Тичини,56","(04346) 2-13-04","Павліченко Василь Миколайович","pogr_crl@ukr.net","01.03.2012","АГ №598098","14.08.2016","перша"  ],
          ["2","Погребищенський центр первинної медико-санітарної допомоги","22200, Вінницька обл., м.Погребище, вул.Павла Тичини,56","(04346) 2-12-64","Роздольський Іван Григорович","pogr_cpmsd@ukr.net","24.01.2013","АЕ №196722","24.07.2018","друга"  ],
          ["Теплицький район","","","","","","","","",""  ],
          ["№ п/п","Назва медичної установи","Адреса","Контактні телефони","Головний лікар","Електронна пошта","Ліцензія на право здійснювати медичну діяльність","","","Категорія"  ],
          ["","","","","","","Термін дії ліцензії з","№ ліцензії серія","Термін дії акредитаційного сертифіката по",""  ],
          ["1","Теплицька лікарня планового лікування","23800, Вінницька обл., Теплицький район, смт.Теплик вул.Чорновола, 4","(04353) 2-11-30","Красиленко Іван Федорович","teplik_crl@ukr.net","16.02.2012","АЕ №282044","23.01.2018","друга"  ],
          ["2","Теплицький центр первинної медико-санітарної допомоги","23800, Вінницька обл., смт. Теплик,  вул.Чорновола, 4","(04353) 2-12-32","Шевченко Віталій Петрович","teplik_cpmsd@ukr.net","19.07.2012","Ад №063678","27.11.2017","друга"  ],
          ["Тиврівський район","","","","","","","","",""  ],
          ["№ п/п","Назва медичної установи","Адреса","Контактні телефони","Головний лікар","Електронна пошта","Ліцензія на право здійснювати медичну діяльність","","","Категорія"  ],
          ["","","","","","","Термін дії ліцензії з","№ ліцензії серія","Термін дії акредитаційного сертифіката по",""  ],
          ["1","Тиврівська центральна районна лікарня","23300 Вінницька область  смт. Тиврів, вул.Шевченка, 2","(04355) 2-12-34","Присяжний Петро Олександрович","tyvrov_crl@ukr.net","23.02.2012","АГ №598066","23.09.2016","перша"  ],
          ["2","Тиврівський центр первинної медико-санітарної допомоги","23320,  Вінницька область, Тиврівський район,  смт. Сутиски, площа Перемоги, 16","(04355) 2-83-03","Приймак Валерій Миколайович","tivrov_rmcpmsd@ukr.net","01.03.2012","АГ №598227","27.11.2017","друга"  ],
          ["Томашпільський район","","","","","","","","",""  ],
          ["№ п/п","Назва медичної установи","Адреса","Контактні телефони","Головний лікар","Електронна пошта","Ліцензія на право здійснювати медичну діяльність","","","Категорія"  ],
          ["","","","","","","Термін дії ліцензії з","№ ліцензії серія","Термін дії акредитаційного сертифіката по",""  ],
          ["1","Томашпільська центральна районна лікарня","24200, Вінницька обл., Томашпільський район м.Томашпіль вул Леніна 25","(04348) 2-16-56","Краківська Олена Миколаївна","tm_crl@ukr.net","07.03.2013","АЕ №196945","23.09.2016","вища"  ],
          ["2","Томашпільський центр первинної медико-санітарної допомоги","24200 Вінницька обл. смт.Томашпіль вул Леніна 103","(04348) 2-24-06","Семенюк Світлана Олександрівна","tom_medcentr@ukr.net","17.05.2012","АГ №600532","27.11.2017","друга"  ],
          ["3","КЗ \"Рожнятівська обласна наркологічна лікарня\" ","24212 Вінницька область Томашпільський район с.Рожнятівка","(04348) 4-73-44","Шведський Василь Терентійович","rognat70@ukr.net","01.03.2012","АГ №597902","28.05.2018","друга"  ],
          ["Тростянецький район","","","","","","","","",""  ],
          ["№ п/п","Назва медичної установи","Адреса","Контактні телефони","Головний лікар","Електронна пошта","Ліцензія на право здійснювати медичну діяльність","","","Категорія"  ],
          ["","","","","","","Термін дії ліцензії з","№ ліцензії серія","Термін дії акредитаційного сертифіката по",""  ],
          ["1","Тростянецька центральна районна лікарня","24300, Вінницька обл. Тростянецький р-н,смт.Тростянець,вул.Мічуріна 60","(04343) 2-22-49","Гіленко Анатолій Вікторович","Trostcrl@ukr.net","28.07.2011","АГ №602800","22.11.2016","перша"  ],
          ["2"," Тростянецький центр первинної медико-санітарної допомоги","24300, Вінницька область,Тростянецький район, смт.Тростянець, вул.Мічуріна,60","(04343) 2-27-83","Пересунько Володимир Андрійович","vin_trost_cpmsd@ukr.net","14.06.2012","АГ №600997","27.11.2017","друга"  ],
          ["3","Печерська обласна лікарня відновного лікування ","23610 Винницька  обл. Тульчинський р-н с.Печера вул.Леніна,7","(04335) 49-9-40","Кравчук Василь Володимирович","pechera_ol1@mail.ru","02.10.2014","АЕ №571563","","перша"  ],
          ["Тульчинський район","","","","","","","","",""  ],
          ["№ п/п","Назва медичної установи","Адреса","Контактні телефони","Головний лікар","Електронна пошта","Ліцензія на право здійснювати медичну діяльність","","","Категорія"  ],
          ["","","","","","","Термін дії ліцензії з","№ ліцензії серія","Термін дії акредитаційного сертифіката по",""  ],
          ["1","Тульчинська центральна районна лікарня","23600, Вінницька обл., м.Тульчин, вул. Леніна,128","(04335) 2-28-57","Лисиця Віталій Петрович","Tulchin_CRL@i.ua","07.10.2011","АГ №603353","14.08.2016","вища"  ],
          ["2","Тульчинський центр первинної медико-санітарної допомоги","23600, Вінницька область, Тульчинський район, м. Тульчин, вул. Леніна,128","(04335) 2-12-93","Нечипорук Віталій Олександрович","tulrcpmsd@ukr.net","29.11.2012","АЕ №196299","17.02.2018","перша"  ],
          ["3","Тульчинська районна стоматологічна поліклініка","23600 м. Тульчин пров. Радянський 1  ","(04335) 2-11-91","Баскевич Людмила Сергіївна ","tulchsnstomat@ukr.net","17.05.2012","АГ №598903","14.08.2016","друга"  ],
          ["Хмільницький район","","","","","","","","",""  ],
          ["№ п/п","Назва медичної установи","Адреса","Контактні телефони","Головний лікар","Електронна пошта","Ліцензія на право здійснювати медичну діяльність","","","Категорія"  ],
          ["","","","","","","Термін дії ліцензії з","№ ліцензії серія","Термін дії акредитаційного сертифіката по",""  ],
          ["1","Хмільницька центральна районна лікарня","22000 Вінницька обл. м.Хмільник вул.Кірова, 71","(04338) 2-33-40","Сивак Володимир Петрович","hmcrl@rambler.ru   hmcrl_kadry@mail.ru","02.06.2011","АГ №601705","23.09.2016","вища"  ],
          ["2","Хмільницький центр первинної медико-санітарної допомоги","22036, Вінницька обл. Хмільницький р-н, с.Пустовійти, вул.Леніна , 108 а","(04338) 2-62-27","Барабаш Михайло Васильович","hm-zpmsd@mail.ru","29.03.2012","АГ №598486","23.01.2018","друга"  ],
          ["3","Хмільницька районна стоматологічна поліклініка","22000, Вінницька обл., м.Хмільник, вул. Пушкіна 66","(04338) 2-14-02","Томашова Людмила Володимирівна","raystomat_hm@ukr.net","10.01.2013","АЕ №196758","23.09.2016","перша"  ],
          ["4","Хмільницька станція швидкої медичної допомоги","22000 Вінницька область, м. Хмільник, вул Кірова, 71","(04338) 2-42-48","Браславська Інна Григорівна","stmd.hm@ukr.net","11.06.2015","АЕ №638985","",""  ],
          ["5","Хмільницька обласна фізіотерапевтична лікарня","22000 м.Хмільник, вул. Шолом Алейхема,8","(04338) 2-31-23","Бабій Олег Ігорович","vin.ofl.hm@rambler.ru","30.09.2010","АВ №567065","14.08.2016","вища"  ],
          ["Чернівецький район","","","","","","","","",""  ],
          ["№ п/п","Назва медичної установи","Адреса","Контактні телефони","Головний лікар","Електронна пошта","Ліцензія на право здійснювати медичну діяльність","","","Категорія"  ],
          ["","","","","","","Термін дії ліцензії з","№ ліцензії серія","Термін дії акредитаційного сертифіката по",""  ],
          ["1","Чернівецька лікарня планового лікування","24100 Вінницька обл., Чернівецький район, смт. Чернівці  вул.Кірова  10","(04357) 2-14-33","Корнєв Олександр Олександрович","chernlpl@ukr.net","25.04.2013","АЕ №281800","23.01.2018","друга"  ],
          ["2","Чернівецький центр первинної медико-санітарної допомоги","24100 Вінницька область Чернівецький район смт.Чернівці вул.Кірова 10","(04357) 2-13-35","Зінич Катерина Іванівна","chernpmsd@ukr.net","26.07.2012","АД №063800","23.01.2018","друга"  ],
          ["Чечельницький район","","","","","","","","",""  ],
          ["№ п/п","Назва медичної установи","Адреса","Контактні телефони","Головний лікар","Електронна пошта","Ліцензія на право здійснювати медичну діяльність","","","Категорія"  ],
          ["","","","","","","Термін дії ліцензії з","№ ліцензії серія","Термін дії акредитаційного сертифіката по",""  ],
          ["1","Чечельницька лікарня планового лікування","24800 Вінницька обл.смт.Чечельник вул.Карла Маркса 60","(04351) 2-11-03","Могила Сергій Миколайович","chhalp@ukrpost.ua","16.08.2012","АЕ №281847","18.12.2017","друга"  ],
          ["2","Чечельницький центр первинної медико-санітарної допомоги","24800, Вінницька обл., Чечельницький р-н, смт.Чечельник вул. К.Маркса,60","(04351) 2-19-77","Коваль Віктор Аврамович","chechcentr@ukr.net","12.04.2012","АГ №598491","18.12.2017","друга"  ],
          ["Шаргородський район","","","","","","","","",""  ],
          ["№ п/п","Назва медичної установи","Адреса","Контактні телефони","Головний лікар","Електронна пошта","Ліцензія на право здійснювати медичну діяльність","","","Категорія"  ],
          ["","","","","","","Термін дії ліцензії з","№ ліцензії серія","Термін дії акредитаційного сертифіката по",""  ],
          ["1","Шаргородська центральна районна лікарня","23500, Вінницька обл., Шаргородський р-н, м.Шаргород, вул.Пархоменко, 9 ","(04344) 2-16-81","Чорний Віталій Васильович","crl_shar1@ukr.net","21.04.2011","АГ №601144","07.02.2017","вища"  ],
          ["2","Шаргородський центр первинної медико-санітарної допомоги","23500  Вінницька обл. Шаргородський район м. Шаргород вул. Пархоменко,9","(04344) 2-28-63","Чад Петро Степанович","shar.CPMSD@ukr.net                  kadr.CPMSD@ukr.net","08.11.2012","АД №071125","23.01.2018","перша"  ],
          ["Ямпільський район","","","","","","","","",""  ],
          ["№ п/п","Назва медичної установи","Адреса","Контактні телефони","Головний лікар","Електронна пошта","Ліцензія на право здійснювати медичну діяльність","","","Категорія"  ],
          ["","","","","","","Термін дії ліцензії з","№ ліцензії серія","Термін дії акредитаційного сертифіката по",""  ],
          ["1","Ямпільська центральна районна лікарня","24500, Вінницька обл. Ямпільський р-н м.Ямпіль вул. Пирогова 1.","(04336) 2-10-52","Ліваковський Костянтин Сергійович","yamp_likar@ukr.net","10.01.2013","АЕ №196997","14.08.2016","вища"  ],
          ["2","Ямпільський центр первинної медико-санітарної допомоги","24500, Вінницька обл., Ямпільський р-н, м.Ямпіль вул. Пирогова,1","(04336) 2-25-58","Плахотна Галина Пилипівна","yampil_medcentr@ukr.net","24.05.2012","АГ №600313","27.11.2017","перша"  ],
          ["м.Ладижин","","","","","","","","",""  ],
          ["№ п/п","Назва медичної установи","Адреса","Контактні телефони","Головний лікар","Електронна пошта","Ліцензія на право здійснювати медичну діяльність","","","Категорія"  ],
          ["","","","","","","Термін дії ліцензії з","№ ліцензії серія","Термін дії акредитаційного сертифіката по",""  ],
          ["1","Ладижинське  міське територіальне медичне об'єднання","24321 Вінницька обл.,  м.Ладижин,вул.Ентузіастів,24","(04343) 6-11-92","Альчук Дмитро Павлович","ladmed@ukrpost.ua","10.02.2011","АГ №570198","20.12.2016","перша"  ],
          ["Інші заклади","","","","","","","","",""  ],
          ["№ п/п","Назва медичної установи","Адреса","Контактні телефони","Головний лікар","Електронна пошта","Ліцензія на право здійснювати медичну діяльність","","","Категорія"  ],
          ["","","","","","","Термін дії ліцензії з","№ ліцензії серія","Термін дії акредитаційного сертифіката по",""  ],
          ["1","Обласний КЗ \"Вінницький обласний дитячий кардіоревма­тологічний санаторій\" (м. Вінниця)","21019 м.Вінниця вул. Нагірна, 17","(0432) 68-60-02","Слічний Олександр Іванович","vodcrs@ukr.net","05.04.2012","АГ №598549","23.01.2018","перша"  ],
          ["2","Заболотненський дитячий  психоневрологічний  санаторійі  ім. ак. Д.К.Заболотного   (Крижопільський р-н)","24631, Вінницька область Крижопільський р-н, с.Заболотне вул. Леніна,2","(04340) 2-86-85","Потурей Василь Дмитрович","San-3@i.ua","27.09.2012","АД №071014","20.07.2015","перша"  ],
          ["3","Маньковецький обласний дитячий туберкульозний санаторій \"Зелений гай\" (Барський р-н)","23030, Вінницька обл. Барський р-н с.Маньківці санаторій \"Зелений гай\" ","(04341) 34-7-37","Миколюк Петро Кузьмич","zelenyugau1@rambler.ru; modts.zg@gmail.com","27.03.2014","АЕ №460190","24.07.2018","друга"  ],
          ["4","Могилів-Подільський дитячий легеневий тубсанаторій","24000, Вінницька обл., м.Могилів-Подільський, вул. акад.Заболотного,4","(04337) 6-65-20","Коваль Оксана Дмитрівна","mogpod_sanatoriy@mail.ru","04.07.2012","АГ №600678","26.06.2016","перша"  ],
          ["5","КЗ Кашперівський дитячий  туберкульозний санаторій \"Лісова пісня \"  (Козятинський р-н)","22121 с.Кашперівка .провулок Санаторний,1, Козятинський р-н. Вінницька обл.","(04342) 3-02-36","Євтушок Олександр Петрович","Kashpersanatoriy@mail.ru","24.03.2011","АГ №601572","23.04.2018","перша"  ],
          ["6","Спеціалізований санаторій для дорослих \"Северинівка\" (Жмеринський р-н)","23126,  Вінницька обл. Жмеринський р-н   с.Северинівка, вул.Санаторська,1","(04332) 3-56-41","Малащук Володимир Данилович","sanatoriy_sever@ukr.net","26.09.2013","АЕ №281543","","перша"  ],
          ["7","Тиманівський обласний протитуберкульозний санаторій для дорослих (Тульчинський р-н)","23644 Вінницька обл. Тульчинський район с.Тиманівка вул.Желюка 17 ","(04335) 2-19-94","в.о. Ахевич Микола Кирилович","tubsanator@ukr.net","05.12.2013","АЕ №281915","15.10.2010","друга"  ],
          ["8","Тульчинський дитячий ортопедичний санаторій","23600, Вінницька обл. м.Тульчин, вул. Леніна 94","(04335) 2-34-72","Козинський Микола Олександрович","tulchinskij_dos@ukr.net","29.12.2010","АГ №570479","30.05.2015","вища"  ],
          ["9","Обласний КЗ \"Вінницький спеціалізований будинок дитини з ураженням центральної нервової системи та порушенням психіки\"","21029  м.Вінниця, вул.Мечнікова,34 ","(0432) 51-11-45","Андрієвська Надія Марківна ","bydunok_dutunu@ukr.net","20.05.2010","АВ №539834","17.02.2018","перша"  ],
          ["10","Тульчинський обласний спеціалізований будинок дитини для дітей з ураженням центральної нервової системи та порушенням психіки","23600, м. Тульчин вул.Шевченко,33","(04335) 2-32-07","Мазур Марія Олексіївна","buddut@ukr.net","05.08.2010","АВ №565707","07.02.2017","вища"  ],
          ["11","Обласна КУ \"Вінницька обласна станція переливання крові\"","21018 м.Вінниця вул. Пирогова, 48","(0432) 35-30-09","Банах Оксана Іванівна","vospkvin@ukr.net   personal-vospkvin@ukr.net","04.07.2012","АВ №611972","31.10.2016","вища"  ],
          ["12","Центр \"Здоров'я\"","21018, м.Вінниця, вул.Писарєва,23","(0432) 52-46-03","Васильчук Тамара Іванівна","vocz_@ukr.net","","","",""  ],
          ["13","Інформаційно-аналітичний центр медичної статистики Вінницької області","21036 м. Вінниця. вул. Писарєва, 23","(0432) 533-186","Железняк Василь Дмитрович","ukrHealth2008@i.ua","Не підлягає ліцензуванню","","",""  ],
          ["14","Вінницький міський інформаційно-аналітичний центр медичної статистики","21100, м.Вінниця, вул. Соборна,59 к. 909, 911","(0432) 67-17-25","Венцківська Наталія Іванівна","viniacms@ukr.net","не підлягає ліцензуванню","","",""  ],
          ["15","Обласне бюро судово-медичної експертизи","21012, м. Вінниця, вул. Г. Успенського, 83","(0432) 55-28-70","Древицький Олександр Іванович","sme_oblvin@mail.ru","Не підлягає ліцензуванню","","",""  ],
          ["16","Вінницьке обласне патологоанатомічне бюро","21018, м. Вінниця, вул. Пирогова, 46, корпус № 2 ","(0432) 67-00-68","Холод Любов Павлівна","vopab_vinn@ukr.net","23.04.2015","АЕ №638623","",""  ],
          ["17","Вінницький обласний центр медико-соціальної експертизи ","21029  м.Вінниця вул. Хмельницьке шосе,92","(0432) 69-70-41","Костенко Ігор Миколайович","vinnmsek@ukr.net","18.05.2009-18.05.2014","АВ №471316","",""  ],
          ["18","Обласна спецмедбаза","21036 м. Вінниця. вул. Писарєва, 23","","Манжуловський Олександр Феофанович","","","","",""  ],
          ["навчальні заклади","","","","","","","","",""  ],
          ["№ п/п","Назва медичної установи","Адреса","Контактні телефони","Головний лікар","Електронна пошта","Ліцензія на право здійснювати медичну діяльність","","","Категорія"  ],
          ["","","","","","","Термін дії ліцензії з","№ ліцензії серія","Термін дії акредитаційного сертифіката по",""  ],
          ["1","Вінницький медичний коледж ім. акад. Д.К. Заболотного","21037 м. Вінниця, вул. Пирогова, 57","(0432) 35-34-90","Андрієвський Іван Юрійович","vinmedkollege@mail.ru  www.vmc.vn.ua","","","",""  ],
          ["2","Бершадський медичний коледж","24400 Вінницька обл., м.Бершадь, вул Червоноармійська, 167","(04352) 2-86-12","Оніщенко Катерина Миколаївна","bmu2004@rambler.ru","","","",""  ],
          ["3","Гайсинський медичний коледж","23700, Вінницька обл. м. Гайсин вул. Б. Хмельницького,46","(04334) 2-14-03","Саблук Анатолій Григорович","gaisin_medcoll@ukr.net","","","",""  ],
          ["4","Могилів-Подільський медичний коледж","24000, м.Могилів-Подільський, Вінницької обл. вул. Сагайдачного, 6","(04337) 6-54-92","Кордон Володимир Михайлович","mogpodmedcollege@ukr.net","","","",""  ],
          ["5","Обласний центр післядипломної освіти медичних працівників","21050, м. Вінниця, вул. Грушевського, 2","(0432)35-06-67","Кириченко Вікторія Іванівна","","","","",""  ],
          ["6","Науково-медична бібліотека","21018, м. Вінниця, вул Льва Толстого, 11","(0432)35-06-53","Берладин Галина Василівна","vin.medbiblioteka@i.ua","","","",""  ]
      ]
    end

    def show
      @news = News.find(params[:id])
    end

    def new
      @news = News.new
    end

    def edit
      @news = News.find(params[:id])
    end

    def create
      @news = News.new(news_params)
      @news.user = current_user
      respond_to do |format|
        if @news.save
          format.html { redirect_to @news, notice: 'Новина успішно створена.' }
          format.json { render action: 'show', status: :created, location: @news }
        else
          format.html { render action: 'new' }
          format.json { render json: @news.errors, status: :unprocessable_entity }
        end
      end
    end

    def update
      @news = News.find(params[:id])

      unless news_params[:title].blank?
        unless news_params[:description].blank?
          unless news_params[:image].blank?
            @news.remove_image!
          end
        end
      end
      respond_to do |format|
        if @news.update(news_params)
          format.html { redirect_to @news, notice: 'Новина успішно оновлена.' }
          format.json { render action: 'show', status: :created, location: @news }
        else
          format.html { render action: 'edit' }
          format.json { render json: @news.errors, status: :unprocessable_entity }
        end
      end
    end

    def destroy
      @news = News.find(params[:id])
      @news.destroy

      redirect_to admin_news_index_path
    end

  private

    def news_params
      params.require(:admin_news).permit(:title, :pre_text, :description, :publish_on, :publish_up, :publish_down, :image)
    end
  end
end