# This file should contain all the record creation needed to seed the database with its default values.
# The data can then be loaded with the rake db:seed (or created alongside the db with db:setup).
#
# Examples:
#
#   cities = City.create([{ name: 'Chicago' }, { name: 'Copenhagen' }])
#   Mayor.create(name: 'Emanuel', city: cities.first)

@m_s_g = ["Заклади первинного рівня надання медичної допомоги",
          "Заклади вторинного рівня надання медичної допомоги",
          "Заклади третинного  рівня надання медичної допомоги",
          "Заклади ШМД",
          "Санаторії",
          "Будинки дитини",
          "Інші заклади",
          "Медичні навчальні заклади"]
@m_s = [
    [
        ["1"," ЦПМСД №1","21011 Вінницька обл., м. Вінниця, вул. Пархоменко,13","(0432) 66-80-16","Фіщенко Людмила Володимирівна","cpmsd1-vn@ukr.net (секретар)","17.04.2014","АЕ №459863","",""  ],
        ["2"," ЦПМСД №2","21050 м. Вінниця, вул. Першотравнева, б.44","(0432) 67-06-81","Кривов’яз Тамара Миколаївна","kz.cpmsd2@ukr.net відділ кадрів: szvyagin20@gmail.com","12.07.2012","АГ №600941","17.02.2018","вища"  ],
        ["3"," ЦПМСД №3","21029 м. Вінниця, вул. Хмельницьке шосе, 96","(0432) 46-74-19","Малик Тетяна Анатоліївна","vincpmsd3@ukr.net","25.10.2012","АД №071373","23.01.2018","вища"  ],
        ["4","ЦПМСД №4","21009 м.Вінниця, вул. 50 р. Перемоги, 18","(0432) 55-21-33","Семерук Наталія Олексіївна","mpmv3@vinnitsa.com","27.06.2012","АГ №600831","",""  ],
        ["5","ЦПМСД №5","21001, м. Вінниця вул. 50 - річчя Перемоги, 49","(0432) 27-58-76","Роман Наталя Іванівна","cpmsd5vin@ukr.net","15.11.2012","АД №071404","",""  ],
        ["6","Барський центр первинної медико-санітарної допомоги","23000 Вінницька обл., Барський р - н., м. Бар, вул. Рози Люксембург № 34","(04341) 2-21-60","Капиця Володимир Миколайович","barmedcentr@ukr.net","31.05.2012","АГ №600428","27.11.2017","друга"  ],
        ["7","Бершадський центр первинної медико-санітарної допомоги","24400, Вінницька область, м.Бершадь, вул. Будкевича,2","(04352) 2-41-02","Брикуля Лілія Іванівна","kubrcpmsd@ukr.net","16.02.2012","АГ №597691","26.08.2017","перша"  ],
        ["8","Вінницький центр первинної медико-санітарної допомоги","21029 Вінницька область, м.Вінниця Хмельницьке шосе,92","(0432) 51-11-89","Шеремета Юрій Петрович","vinmedrc@ukr.net","23.08.2012","АД №063070","26.06.2018","друга"  ],
        ["9","Гайсинський центр первинної медико-санітарної допомоги","Вінницька область, Гайсинський район, м.Гайсин, вул.Гурвіча,1 23700","(04334) 2-53-52","Кацан Тетяна Миколаївна","gaysincentr@ukr.net","19.04.2012","АГ №598378","26.08.2017","друга"  ],
        ["10"," Жмеринський центр первинної медико-санітарної допомоги","23108 Вінницька область, Жмеринський район, село Леляки","(04332) 2-06-58","Калінський Олег Ігорович","vin_zhmerinka_cpmsd@ukr.net","27.06.2012","АГ №601000","18.12.2017","друга"  ],
        ["11","Ілінецький центр первинної медико-санітарної допомоги","22700, Вінницька область, м. Іллінці вул. Енгельса 48","(04345) 2-36-33","Атаманюк Олександр Єнісеєвич","illincyZPMSD@mail.ru","24.05.2012","АГ №600098","17.02.2018","друга"  ],
        ["12","Калинівський центр первинної медико-санітарної допомоги","22400, Вінницька область, Калинівський район, місто Калинівка, вул. Чкалова, 6","(04333) 4-11-61","Македонський Василь Антонович","kalin_medcentr@ukr.net","26.12.2011","АГ №599803","27.11.2017","перша"  ],
        ["13","Козятинський центр первинної медико-санітарної допомоги","22100, Вінницька обл. м.Козятин, вул.Червоноармійська,28","(04342) 2-50-84","Дзема Олександр Іванович","kazatin_pmsd@ukr.net","03.06.2010","АВ №554244","",""  ],
        ["14","Крижопільський центр первинної медико-санітарної допомоги","24600 Вінницька обл.,Крижопільський р-н смт. Крижопіль вул. 9-Січня 6","(04340) 2-38-05","Килімник Леся Анатоліївна","kryz.centr@gmail.com","02.08.2012","АД №064367","27.11.2017","перша"  ],
        ["15","Липовецький центр первинної медико-санітарної допомоги","22500 Віницька область, м. Липовець, вул. Пирогова, 9","(04358) 2-24-21","Казімірко Аделя Нестерівна","lipov_cpmsd@ukr.net","25.10.2012","АД №071366","23.04.2018","друга"  ],
        ["16","Літинський центр первинної медико-санітарної допомоги","22300, ВІнницька область, Літинський район, смт. Літин,вул. Пирогова 17","(04347) 2-16-85","Дяченко Павліна Андріївна","litin_cpmsd@ukr.net","29.03.2012","АГ №598817","18.12.2017","друга"  ],
        ["17","Могилів-Подільський районний центр первинної медико-санітарної допомоги","24000, вул. В Стуса, 54/7","(04337) 6-36-90","Манжурова Олена Володимирівна","mogpod_cpmsd@hotmail.com","06.09.2012","АД №063373","23.01.2018","друга"  ],
        ["18","Могилів-Подільський міський центр первинної медико-санітарної допомоги","24000,Вінницька обл., м.Могилів-Подільський, вул.В.Стуса 54/7","(04337) 6-36-68","Череватова Наталя Павлівна","vin.mogpod.mcpmsd@mail.ru","11.04.2013","АЕ №197664","28.05.2018","вища"  ],
        ["19","Муровано-Куриловецький центр первинної медико-санітарної допомоги","23400 Вінницька область, Мурованокуриловецький район, вул. Жовтнева,87","(04356) 2-17-72","Сидоренко Лариса Генріхівна","vin_murkur_cpmsd@ukr.net","15.11.2012","АД №071346","23.01.2018","перша"  ],
        ["20","Немирівський центр первинної медико-санітарної допомоги","22800 Вінницька область, м. Немирів, вул. Євдокименко, 21","(04331) 2-19-65","Герасименко Леонід Михайлович","vinnemirovcpmsd@ukr.net kadru_nemirov@ukr.net","24.05.2012","АГ №600338","26.08.2017","друга"  ],
        ["21","Оратівський центр первинної медико-санітарної допомоги","22600, Вінницька область, Оратівський район, смтОратів вул.Пирогова 2","(04330) 2-13-47","Якимович Ігор Васильович","orativ_centr@i.ua","05.12.2011","АГ №599457","23.01.2018","друга"  ],
        ["22","Піщанський центр первинної медико-санітарної допомоги","24700 Вінницька область, Піщанський район, смт. Піщанка, вул. Леніна,42 ","(04349) 2-24-50","Руденко Володимир Степанович","centrmedpis@mail.ru","15.03.2012","АГ №597945","26.08.2017","друга"  ],
        ["23","Погребищенський центр первинної медико-санітарної допомоги","22200, Вінницька обл., м.Погребище, вул.Павла Тичини,56","(04346) 2-12-64","Роздольський Іван Григорович","pogr_cpmsd@ukr.net","24.01.2013","АЕ №196722","24.07.2018","друга"  ],
        ["24","Теплицький центр первинної медико-санітарної допомоги","23800, Вінницька обл., смт. Теплик, вул.Чорновола, 4","(04353) 2-12-32","Шевченко Віталій Петрович","teplik_cpmsd@ukr.net","19.07.2012","Ад №063678","27.11.2017","друга"  ],
        ["25","Тиврівський центр первинної медико-санітарної допомоги","23320, Вінницька область, Тиврівський район, смт. Сутиски, площа Перемоги, 16","(04355) 2-83-03","Приймак Валерій Миколайович","tivrov_rmcpmsd@ukr.net","01.03.2012","АГ №598227","27.11.2017","друга"  ],
        ["26","Томашпільський центр первинної медико-санітарної допомоги","24200 Вінницька обл., смт.Томашпіль, вул Леніна 103","(04348) 2-24-06","Семенюк Світлана Олександрівна","tom_medcentr@ukr.net","17.05.2012","АГ №600532","27.11.2017","друга"  ],
        ["27"," Тростянецький центр первинної медико-санітарної допомоги","24300, Вінницька область,Тростянецький район, смт.Тростянець, вул.Мічуріна,60","(04343) 2-27-83","Пересунько Володимир Андрійович","vin_trost_cpmsd@ukr.net","14.06.2012","АГ №600997","27.11.2017","друга"  ],
        ["28","Тульчинський центр первинної медико-санітарної допомоги","23600, Вінницька область, Тульчинський район, м. Тульчин, вул. Леніна,128","(04335) 2-12-93","Нечипорук Віталій Олександрович","tulrcpmsd@ukr.net","29.11.2012","АЕ №196299","17.02.2018","перша"  ],
        ["29","Хмільницький центр первинної медико-санітарної допомоги","22036, Вінницька обл. Хмільницький р-н, с.Пустовійти, вул.Леніна , 108 а","(04338) 2-62-27","Барабаш Михайло Васильович","hm-zpmsd@mail.ru","29.03.2012","АГ №598486","23.01.2018","друга"  ],
        ["30","Чернівецький центр первинної медико-санітарної допомоги","24100 Вінницька область, Чернівецький район, смт.Чернівці, вул.Кірова 10","(04357) 2-13-35","Зінич Катерина Іванівна","chernpmsd@ukr.net","26.07.2012","АД №063800","23.01.2018","друга"  ],
        ["31","Чечельницький центр первинної медико-санітарної допомоги","24800, Вінницька обл., Чечельницький р-н, смт.Чечельник вул. К.Маркса,60","(04351) 2-19-77","Коваль Віктор Аврамович","chechcentr@ukr.net","12.04.2012","АГ №598491","18.12.2017","друга"  ],
        ["32","Шаргородський центр первинної медико-санітарної допомоги","23500 Вінницька обл., Шаргородський район, м. Шаргород вул. Пархоменко,9","(04344) 2-28-63","Чад Петро Степанович","shar.CPMSD@ukr.net kadr.CPMSD@ukr.net","08.11.2012","АД №071125","23.01.2018","перша"  ],
        ["33","Ямпільський центр первинної медико-санітарної допомоги","24500, Вінницька обл., Ямпільський р-н, м.Ямпіль вул. Пирогова,1","(04336) 2-25-58","Плахотна Галина Пилипівна","yampil_medcentr@ukr.net","24.05.2012","АГ №600313","27.11.2017","перша"  ]
    ],
    [
        ["1","Міська клінічна лікарня №1","21029, м.Вінниця, вул.Хмельницьке шосе,96","(0432) 51-12-31","Турський Олександр Феодосійович","vinmkl1@ukr.net","21.07.2011","АГ №602633","23.09.2016","вища"  ],
        ["2","Міська клінічна лікарня швидкої медичної допомоги ","21032, м.Вінниця,вул.Київська, 68","(0432) 66-53-39","Фомін Олександр Олександрович","mkl2schmd@ukr.net","21.06.2012","АГ №600562","14.08.2016","вища"  ],
        ["3","Міська клінічна лікарня №3","21019 м.Вінниця, вул Маяковського, 138","(0432) 60-58-12","Фостаковський Дмитро Стефанович","sekretar@mkl3.vn.ua kadri@mkl3.vn.ua","20.09.2012","АД №063222","09.11.2018","перша"  ],
        ["4","Міська лікарня “Центр матері та дитини”","21019 м.Вінниця, вул . Маяковського, 138","(0432) 68-70-10","Присяжнюк Володимир Петрович","micentr@ukr.net","22.03.2012","АГ №598516","24.07..2018","вища"  ],
        ["5","Вінницький міський клінічний пологовий будинок №1","21029, м.Вінниця, вул.Хмельницьке шосе 98","(0432) 51-11-08","Коваленко Віктор Степанович","polbud1@ukr.net","27.12.2012","АЕ №196786","14.08.2016","вища"  ],
        ["6","КЗ “Вінницький міський клінічний пологовий будинок №2”","21001, м. Вінниця, пр-т. Коцюбинського, 50","(0432) 27-25-24","Фесун Анатолій Григорович","roddom@svitonline.com","14.06.2012","АД №071050","14.08.2016","вища"  ],
        ["7","Міське комунальне підприємство \"Медичний стоматологічний центр\" ","21021 Вінницька обл., м.Вінниця, вул. Келецька, 68","(0432) 55-11-48","Цибулюк Андрій Якович","spvmksc@ukr.net","15.08.2013","АЕ №281292","09.11.2018","перша"  ],
        ["8","КЗ \"Міська клінічна стоматологічна поліклініка\"","21050 м.Вінниця, вул.Архитектора Артинова,24","(0432) 35-82-88","Герасимчук Валентина Василівна","VMKDSP@ukr.net","03.04.2014","АЕ №450124","26.10.2012","вища"  ],
        ["9","КП “Міський лікувально-діагностичний Центр”","21032, Вінницька обл., м.Вінниця, вул.Київська,68","(0432) 66-47-86","Бланар Оксана Леонідівна","сmdc@ukr.net","07.11.2013","АЕ №281715","",""  ],
        ["10","Барська центральна районна лікарня","23000 Вінницька обл., Барський р - н., м. Бар, вул. Рози Люксембург № 34","(04341) 2-25-45","Костенко Олександр Сергійович","barlikarnya@rambler.ru","26.05.2011","АГ №601615","14.08.2016","перша"  ],
        ["11","Барська районна стоматологічна поліклініка","23000 м. Бар , вул. Нахімова. 21","(04341) 2-20-17","Попель Григорій Петрович","barstom@ukr.net","31.05.2012","АГ №600378","22.11.2016","перша"  ],
        ["12","Бершадська окружна лікарня інтенсивного лікування","24400, Вінницька область, м.Бершадь,вул. Будкевича 2","(04352) 2-39-01","Залецький Василь Анатолійович","bershad_olil@ukr.net","18.08.2011","АЕ №283014","17.02.2018","вища"  ],
        ["13","Вінницька центральна районна клінічна лікарня","21029 м.Вінниця, Хмельницьке шосе,92","(0432) 51-12-88","Кривов'яз Олександр Леонідович","vinrtmo65@ukr.net","24.05.2012","АГ №600197","18.12.2017","вища"  ],
        ["14","Гайсинська центральна районна лікарня","23700 Вінницька обл., м. Гайсин, вул. Гурвіча 1","(04334) 2-50-59","Кохан Ігор Васильович","gaysin_tmo@mail.ru","23.06.2011","АГ №602002","14.08.2016","вища"  ],
        ["15","Жмеринська центральна районна лікарня","23100 м. Жмеринка, вулиця Київська 288","(04332) 2-15-15","Боровський Ростислав Васильович","zhcrl@ukr.net","10.01.2012","АГ №597447","23.09.2016","вища"  ],
        ["16","Жмеринська районна стоматологічна поліклінніка","23100, Вінницька обл., Жмеринський р-н, м. Жмеринка, вул.Б.Хмельницького, 40","(04332) 5-07-38","Гаврилюк Василь Васильович","Zmerstom@ukr.net","05.02.2015","АЕ №638249","24.02.2019","друга"  ],
        ["17","Ілінецька центральна районна лікарня","22700 Вінницька обл., м.Іллінці, вул. Енгельса, 48","(04345) 2-11-47","Насушний Віктор Олександрович","rtmo@ukrpost.ua","10.01.2012","АГ №597688","14.08.2016","вища"  ],
        ["18","Калинівська центральна районна лікарня","22400, Вінницька область, м.Калинівка, вул.Чкалова, 6","(04333) 2-20-61","Костюк Володимир Григорович","kalinzrl@ukr.net","04.08.2011","АГ №602742","18.12.2017","перша"  ],
        ["19","Козятинська центральна районна лікарня","22100 Вінницька обл., м.Козятин, вул. Червоноармійська 75","(04342) 2-25-05","Гуцол Володимир Григорович","koztermed@ukrpost.ua kadry_kcrl@ukr.net","06.11.2014","АЕ №571565","20.12.2016","вища"  ],
        ["20","Козятинська районна стоматологічна поліклініка","22100 Вінницька обл., Козятинський район, м.Козятин вул. Червоноармійська,28","(04342) 2-29-27","Медушевська Любов Григорівна","stomatpoliklinika08@mail.ru","16.04.2015","АЕ №638567","14.08.2016","перша"  ],
        ["21","Крижопільська окружна лікарня інтенсивного лікування","24600 Вінницька обл., Крижопільський район, смт.Крижопіль, вул.9 січня,10","(04340) 2-25-83","Рузяк Валерій Іванович","kryzhopol_olil@ukr.net","21.06.2012","АЕ №283291","26.06.2018","вища"  ],
        ["22","Липовецька центральна районна лікарня","22500, Вінницька область, Липовецький район, м. Липовець, вул. Пірогова 9","(04358) 2-12-67","Дмитрук Олександр Михайлович","crl_lipov@ukrpost.ua, kadry_lip_crl@i.ua","18.08.2011","АГ №603264","09.11.2018","перша"  ],
        ["23","Літинська центральна районна лікарня","22300 Вінницька обл., смт.Літин, вул.Пирогова,17","(04347) 2-12-51","Кобель Сергій Ульянович","litin-rtmo@ukr.net","21.11.2011","АГ №603972","14.08.2016","перша"  ],
        ["24","Могилів-Подільська окружна лікарня інтенсивного лікування","24000, м. Могилів-Подільський, вул.Полтавська 89/2","(04337) 6-53-25","Миколюк Василь Васильович","mtmo-mogpod@mail.ru","17.10.2011","АЕ №282262","23.01.2018","вища"  ],
        ["25","Могилів-Подільська міська стоматологічна поліклініка","24000, м. Могилів-Подільський, вул. Київська, 44","(04337) 6-49-63","Соколовська Галина Григорівна","stomat_moq-pod@ukr.net, stomatmogpod44","11.11.2010","АВ №567747","20.12.2016","перша"  ],
        ["26","Муровано-Куриловецька лікарня планового лікування","23400 Вінницька обл.,Мурованокуриловецький р-н, смт.Муровані Курилівці, вул.Жовтнева,87","(04356) 2-10-02","Олійник Мирослав Вікторович","murkur_lpl@ukr.net","01.03.2012","АЕ №281797","23.01.2018","друга"  ],
        ["27","Немирівська центральна районна лікарня","22800 Вінницька область, м. Немирів, вул. Євдокименко, 21","(04331) 2-27-48","Юрець Сергій Єлисеєвич","crl_nem@ukrpost.ua, kadru_nem@meta.ua","04.07.2012","АД №063703","14.08.2016","вища"  ],
        ["28","Оратівська центральна районна лікарня","22600 ВІнницька обл., смт.Оратів, вул.Пирогова 2","(04330) 2-12-47","Садик Микола Іванович","orativ crl@ukrpost.ua","01.03.2012","АГ №59718","23.09.2016","перша"  ],
        ["29","Піщанська лікарня планового лікування","24700 Вінницька обл., Піщанський район, смт.Піщанка, вул.Леніна, буд.42","(04349) 2-12-02","Березюк Людмила Іванівна","likarnya_pis@ukrpost.ua","01.03.2012","АЕ №281798","23.01.2018","друга"  ],
        ["30","Погребищенська центральна районна лікарня","22200, Вінницька обл., м.Погребище, вул.Павла Тичини,56","(04346) 2-13-04","Павліченко Василь Миколайович","pogr_crl@ukr.net","01.03.2012","АГ №598098","14.08.2016","перша"  ],
        ["31","Теплицька лікарня планового лікування","23800, Вінницька обл., Теплицький район, смт.Теплик, вул.Чорновола, 4","(04353) 2-11-30","Красиленко Іван Федорович","teplik_crl@ukr.net","16.02.2012","АЕ №282044","23.01.2018","друга"  ],
        ["32","Тиврівська центральна районна лікарня","23300 Вінницька область, смт. Тиврів, вул.Шевченка, 2","(04355) 2-12-34","Присяжний Петро Олександрович","tyvrov_crl@ukr.net","23.02.2012","АГ №598066","23.09.2016","перша"  ],
        ["33","Томашпільська центральна районна лікарня","24200, Вінницька обл., Томашпільський район, м.Томашпіль вул Леніна 25","(04348) 2-16-56","Краківська Олена Миколаївна","tm_crl@ukr.net","07.03.2013","АЕ №196945","23.09.2016","вища"  ],
        ["34","Тростянецька центральна районна лікарня","24300, Вінницька обл., Тростянецький р-н,смт.Тростянець,вул.Мічуріна,60","(04343) 2-22-49","Гіленко Анатолій Вікторович","Trostcrl@ukr.net","28.07.2011","АГ №602800","22.11.2016","перша"  ],
        ["35","Тульчинська центральна районна лікарня","23600, Вінницька обл., м.Тульчин, вул. Леніна,128","(04335) 2-28-57","Лисиця Віталій Петрович","Tulchin_CRL@i.ua","07.10.2011","АГ №603353","14.08.2016","вища"  ],
        ["36","Тульчинська районна стоматологічна поліклініка","23600 м. Тульчин, пров. Радянський,1 ","(04335) 2-11-91","Баскевич Людмила Сергіївна ","tulchsnstomat@ukr.net","17.05.2012","АГ №598903","14.08.2016","друга"  ],
        ["37","Хмільницька центральна районна лікарня","22000 Вінницька обл., м.Хмільник, вул.Кірова, 71","(04338) 2-33-40","Сивак Володимир Петрович","hmcrl@rambler.ru hmcrl_kadry@mail.ru","02.06.2011","АГ №601705","23.09.2016","вища"  ],
        ["38","Хмільницька районна стоматологічна поліклініка","22000, Вінницька обл., м.Хмільник, вул. Пушкіна 66","(04338) 2-14-02","Томашова Людмила Володимирівна","raystomat_hm@ukr.net","10.01.2013","АЕ №196758","23.09.2016","перша"  ],
        ["39","Чернівецька лікарня планового лікування","24100 Вінницька обл., Чернівецький район, смт. Чернівці, вул.Кірова, 10","(04357) 2-14-33","Корнєв Олександр Олександрович","chernlpl@ukr.net","25.04.2013","АЕ №281800","23.01.2018","друга"  ],
        ["40","Чечельницька лікарня планового лікування","24800 Вінницька обл., смт.Чечельник, вул.Карла Маркса, 60","(04351) 2-11-03","Могила Сергій Миколайович","chhalp@ukrpost.ua","16.08.2012","АЕ №281847","18.12.2017","друга"  ],
        ["41","Шаргородська центральна районна лікарня","23500, Вінницька обл., Шаргородський р-н, м.Шаргород, вул.Пархоменко, 9 ","(04344) 2-16-81","Чорний Віталій Васильович","crl_shar1@ukr.net","21.04.2011","АГ №601144","07.02.2017","вища"  ],
        ["42","Ямпільська центральна районна лікарня","24500, Вінницька обл. Ямпільський р-н, м.Ямпіль, вул. Пирогова, 1","(04336) 2-10-52","Ліваковський Костянтин Сергійович","yamp_likar@ukr.net","10.01.2013","АЕ №196997","14.08.2016","вища"  ],
        ["43","Ладижинське міське територіальне медичне об’єднання","24321 Вінницька обл., м.Ладижин, вул.Ентузіастів,24","(04343) 6-11-92","Альчук Дмитро Павлович","ladmed@ukrpost.ua","10.02.2011","АГ №570198","20.12.2016","перша"  ]
    ],
    [
        ["1","КЗ \"Вінницький регіональний клінічний лікувально-діагностичний центр серцево-судинної патології\"","21029 м.Вінниця, вул.Хмельницьке шосе,96","(0432) 46-55-47","Данильчук Ігор Віталієвич","stat.card.c@ukr.net","","","",""  ],
        ["2","Вінницька обласна клінічна лікарня ім. М.І. Пирогова","21018 м. Вінниця, вул. Пирогова, 46","(0432) 35-31-85","Жупанов Олександр Борисович","VOKLIP@gmail.com","16.06.2010","АВ №554131","25.12.2017","вища"  ],
        ["3","Вінницька обласна дитяча клінічна лікарня","м.Вінниця, вул. Хмельницьке шосе,108","0(432) 55-20-07","Паненко Василь Васильович","kadry_vodkl555@ukr.net","21.04.2011","АГ №601319","17.07.2018","вища"  ],
        ["4","КЗ “Вінницька обласна психоневрологічна лікарня ім.. акад. О.І Ющенка ” ","21005 м.Вінниця, вул. Пирогова, 109","(0432) 50-79-00","Клочко Вадим Леонідович","VPByust@ukr.net; kadruVOPNL@ukr.net","07.11.2011","АГ №603725","29.01.2018","вища"  ],
        ["5","КЗ “Вінницький обласний наркологічний диспансер\n“ Соціотерапія”","21037 Вінницька обл., м.Вінниця вул. Пирогова, 109-В","(0432) 53-50-11","Слободянюк Павло Михайлович","oblnarko@ukr.net","18.07.2013","АЕ №281176","08.04.2018","перша"  ],
        ["6","Вінницький обласний клінічний онкологічний диспансер","21029 м.Вінниця, Хмельницьке шосе,84","(0432) 43-55-88","Шамрай Володимир Анатолійович","nataonko@mail.ru","21.04.2011","АГ №601084","26.09.2016","вища"  ],
        ["7","Вінницький обласний клінічний шкірно-венерологічний диспансер","21050 Вінницька обл., м.Вінниця, вул. Першотравнева, 21","(0432) 67-12-88","Бардашевський Олег Борисович","oshv_d@ukr.net","10.01.2012","АГ №597157","20.07.2015","перша"  ],
        ["8","Вінницький обласний клінічний високоспеціалізований ендокринологічний центр","21010 Вінницька обл., м.Вінниця , вул. Мічуріна 32","(0432) 61-17-36","Прудиус Пилип Григорович","endo@ukr.net","26.05.2011","АЕ №282116","24.12.2016","вища"  ],
        ["9","Вінницький обласний спеціалізований клінічний диспансер радіаційного захисту населення","21018 Вінницька обл., м. Вінниця, вул. В. Стуса, 11","(0432) 35-13-14","Даценко Василь Григорович","voskdrzn@ukrpost.ua","14.11.2011","АГ №603902","29.01.2018","вища"  ],
        ["10","Вінницький обласний клінічний госпіталь ветеранів війни","21005, м.Вінниця, вул. Пирогова, 109-А","(0432) 68-22-92","Бабійчук Валерій Вікторович","vinogiv@ukr.net","31.03.2011","АГ №570946","25.12.2017","вища"  ],
        ["11","Вінницький обласний лікарсько-фізкультурний диспансер","21050 м.Вінниця,вул. Грушевського,2","(0432) 35-22-96","Чернишук Сергій Никифорович","fizdispanser@ukr.net","10.02.2011","АГ №570232","",""  ],
        ["12","КЗ \"Вінницька обласна клінічна дитяча інфекційна лікарня\"","21032 Вінницька обл., м.Вінниця, вул.Київська,68","(0432) 66-62-80","Бронівська Людмила Миколаївна","vocdil@ukr.net","14.07.2013","АЕ №281015","28.05.2018","перша"  ],
        ["13","КЗ “Барська обласна туберкульозна лікарня”","23000 м.Бар, Вінницька обл.,вул.Рози Люксембург, 5 А","(04341) 2-14-50","Вознюк Ганна Іванівна","bar_tub@ukr.net","14.03.2014","АЕ №283355","09.11.2018","перша"  ],
        ["14","Вінницька обласна психіатрична лікарня №2","23222, с-ще Березина, Медмістечко, Вінницький район, Вінницька область","(0432) 56-63-44","Сокур Михайло Іванович","vopl2@i.ua","17.01.2013","АЕ №196815","18.06.2018","вища"  ],
        ["15","Вінницьке обласне спеціалізоване територіальне медичне об'єднання \"Фтизіатрія\"","23233, Вінницька обл., Вінницький р-н, с.Бохоники, комплекс будівель та споруд, буд. б/н","(0432) 56-66-45","Служивий Олександр Петрович","obltub@vinnitsa.com","25.07.2013","АЕ №197463","далі в МОЗ","вища"  ],
        ["16","КО “Вінницький обласний Центр профілактики та боротьби зі СНІДом”","23222, с. Березина \"Медмістечко\" , 5 км Барського шосе, Вінницька обл.","(0432) 56-64-05","Матковський Ігор Анатолійович","aids.center.vin@ukr.net","20.05.2010","АВ №539698","29.01.2018","вища"  ],
        ["17","КЗ \"Вінницький обласний протитуберкульозний диспансер №2\"","21010 Вінницька обл. м. Вінниця, вул. Мічуріна 34","(0432) 35-16-72","Богачук Микола Костянтинович","voptd2@ukr.net","17.05.2012","АД №071049","25.03.2017","перша"  ],
        ["18","КЗ “Козятинська обласна туберкульозна лікарня”","22140 Вінницька обл., Козятинський р-н, с.Сестринівка ","(04342) 2-04-90","Купчик Володимир Миколайович","sestrtub@ukr.net","08.01.2014","АЕ №282211","26.06.2018","перша"  ],
        ["19","КО “Обласний комунальний заклад Крижопільська туберкульозна лікарня”","24600, Вінницька, обл. Крижопіль, вул.Театральна,18","(04340) 2-34-78","Мурзак Валентина Федорівна","tublic24600@ukr.net","19.12.2013","АЕ №282016","24.07.2018","перша"  ],
        ["20","Липовецька обласна лікарня відновного лікування дітей з органічним ураженням центральної нервової системи, порушенням психіки і опорно-рухового апарату","22500, Вінницька обл., Липовецький р-н, м.Липовець, вул. Пирогова, 36","(04358) 2-13-85","Стецюк Людмила Миколаївна","doctor_lipov@ukrpost.ua","30.09.2011","АГ №603333","23.04.2018","перша"  ],
        ["21","КЗ “Могилів-Подільська обласна туберкульозна лікарня”","24000 Вінницька обл., м.Могилів-Подільський, просп. Незалежності,62","(04337) 6-50-42","Цендра Анатолій Станіславович","mog-pod_otl@mail.ru","14.03.2014","АЕ №283331","24.02.2019","перша"  ],
        ["22","КЗ “Рожнятівська обласна наркологічна лікарня” ","24212 Вінницька обл.,Томашпільський район с.Рожнятівка","(04348) 4-73-44","Шведський Василь Терентійович","rognat70@ukr.net","01.03.2012","АГ №597902","28.05.2018","друга"  ],
        ["23","Печерська обласна лікарня відновного лікування ","23610 Винницька обл.,Тульчинський р-н,с.Печера, вул.Леніна,7","(04335) 49-9-40","Кравчук Василь Володимирович","pechera_ol1@mail.ru","02.10.2014","АЕ №571563","09.11.2018","перша"  ],
        ["24","Хмільницька обласна фізіотерапевтична лікарня","22000 м.Хмільник, вул. Шолом Алейхема,8","(04338) 2-31-23","Бабій Олег Ігорович","vin.ofl.hm@rambler.ru","30.09.2010","АВ №567065","14.08.2016","вища"  ]
    ],
    [
        ["1","Вінницька міська станція швидкої медичної допомоги","21009 м.Вінниця, вул.Ширшова,43","(0432) 27-43-33","Шиш Олександр Володимирович","vin03@ukr.net","20.06.2013","АЕ №197224","18.06.2016","вища"  ],
        ["2","КУ ”Територіальне медичне об’єднання ”Вінницький обласний Центр екстреної медичної допомоги та медицини катастроф”","21018, Вінницька область, м.Вінниця, вул. Пирогова 46 А","(0432) 50-84-73","Пірникоза Анатолій Васильович","med_katastrof@ukr.net","25.07.2013","АЕ №197450","",""  ],
        ["3","Бершадська станція швидкої медичної допомоги","24400, Вінницька обл. Бершадський р-н , м. Бершадь, вул. Будкевича 2-А","(04352) 2-22-47","Заболотний Михайло Станіславович","bershmd2013@ukr.net","готують документи для подачі в МОЗ","","",""  ],
        ["4","Гайсинська станція швидкої медичної допомоги","23700, Вінницька обл., Гайсинський р-н, м. Гайсин, вул. Гурвіча, 1 а","(04334) 2-31-07","Звенігородський Юрій Володимрович","gaysin аmbulance@ukr.net","30.10.2014","АЕ №571616","",""  ],
        ["5","Жмеринська міська станція швидкої медичної допомоги","23100 м. Жмеринка, вул. Центральна 26","(04332) 2-19-63","Кузьміна Тетяна Федорівна","zmerinka103@ukr.net","23.06.2011","АГ №602294","18.06.2016","перша"  ],
        ["6","Могилів-Подільська станція швидкої медичної допомоги","24001, Вінницька обл. м. Могилів-Подільський вул. Полтавська, 89/2","(04337) 6-41-25","Блощинська Людмила Михайлівна","sshmd@mail.ru","19.02.2015","АЕ №638371","",""  ],
        ["7","Хмільницька станція швидкої медичної допомоги","22000 Вінницька область, м. Хмільник, вул Кірова, 71","(04338) 2-42-48","Браславська Інна Григорівна","stmd.hm@ukr.net","11.06.2015","АЕ №638985","",""  ]
    ],
    [
        ["1","Обласний КЗ “Вінницький обласний дитячий кардіоревматологічний санаторій” (м. Вінниця)","21019 м.Вінниця, вул. Нагірна, 17","(0432) 68-60-02","Слічний Олександр Іванович","vodcrs@ukr.net","05.04.2012","АГ №598549","23.01.2018","перша"  ],
        ["2","Заболотненський дитячий психоневрологічний санаторійі ім. ак. Д.К.Заболотного (Крижопільський р-н)","24631, Вінницька область, Крижопільський р-н, с.Заболотне, вул. Леніна,2","(04340) 2-86-85","Потурей Василь Дмитрович","San-3@i.ua","27.09.2012","АД №071014","20.07.2015","перша"  ],
        ["3","Маньковецький обласний дитячий туберкульозний санаторій “Зелений гай” (Барський р-н)","23030, Вінницька обл., Барський р-н с.Маньківці санаторій \"Зелений гай\" ","(04341) 34-7-37","Миколюк Петро Кузьмич","zelenyugau1@rambler.ru; modts.zg@gmail.com","27.03.2014","АЕ №460190","24.07.2018","друга"  ],
        ["4","Могилів-Подільський дитячий легеневий тубсанаторій","24000, Вінницька обл., м.Могилів-Подільський, вул. акад.Заболотного,4","(04337) 6-65-20","Коваль Оксана Дмитрівна","mogpod_sanatoriy@mail.ru","04.07.2012","АГ №600678","26.06.2016","перша"  ],
        ["5","КЗ Кашперівський дитячий туберкульозний санаторій “Лісова пісня ” (Козятинський р-н)","22121 с.Кашперівка .провулок Санаторний,1, Козятинський р-н. Вінницька обл.","(04342) 3-02-36","Євтушок Олександр Петрович","Kashpersanatoriy@mail.ru","24.03.2011","АГ №601572","23.04.2018","перша"  ],
        ["6","Спеціалізований санаторій для дорослих “Северинівка“ (Жмеринський р-н)","23126, Вінницька обл. Жмеринський р-н с.Северинівка, вул.Санаторська,1","(04332) 3-56-41","Малащук Володимир Данилович","sanatoriy_sever@ukr.net","26.09.2013","АЕ №281543","09.11.2018","перша"  ],
        ["7","Тиманівський обласний протитуберкульозний санаторій для дорослих (Тульчинський р-н)","23644 Вінницька обл., Тульчинський район, с.Тиманівка, вул.Желюка 17 ","(04335) 2-19-94","Ахевич М.К.","tubsanator@ukr.net","05.12.2013","АЕ №281915","15.10.2010","друга"  ],
        ["8","Тульчинський дитячий ортопедичний санаторій","23600, Вінницька обл., м.Тульчин, вул. Леніна 94","(04335) 2-34-72","Козинський Микола Олександрович","tulchinskij_dos@ukr.net","29.12.2010","АГ №570479","30.05.2015","вища"  ]
    ],
    [
        ["1","Обласний КЗ “Вінницький спеціалізований будинок дитини з ураженням центральної нервової системи та порушенням психіки“","21029 м.Вінниця, вул.Мечнікова,34 ","(0432) 51-11-45","Андрієвська Надія Марківна ","bydunok_dutunu@ukr.net","20.05.2010","АВ №539834","17.02.2018","перша"  ],
        ["2","Тульчинський обласний спеціалізований будинок дитини для дітей з ураженням центральної нервової системи та порушенням психіки","23600, м. Тульчин, вул.Шевченко,33","(04335) 2-32-07","Мазур Марія Олексіївна","buddut@ukr.net","05.08.2010","АВ №565707","07.02.2017","вища"  ]
    ],
    [
        ["1","Обласна КУ “Вінницька обласна станція переливання крові”","21018 м.Вінниця, вул. Пирогова, 48","(0432) 35-30-09","Банах Оксана Іванівна","vospkvin@ukr.net personal-vospkvin@ukr.net","04.07.2012","АВ №611972","31.10.2016","вища"  ],
        ["2","Обласний Центр здоров'я","21018, м.Вінниця, вул.Писарєва,23","(0432) 52-46-03","Каліберська Світлана Григорівна","vocz_@ukr.net","","","",""  ],
        ["3","Інформаційно-аналітичний центр медичної статистики Вінницької області","21036 м. Вінниця. ,вул. Писарєва, 23","(0432) 533-186","Железняк Василь Дмитрович","ukrHealth2008@i.ua","Не підлягає ліцензуванню","","",""  ],
        ["4","Вінницький міський інформаційно-аналітичний центр медичної статистики","21100, м.Вінниця, вул. Соборна,59 к. 909, 911","(0432) 67-17-25","Коробчинська Наталія Валерівна","viniacms@ukr.net","не підлягає ліцензуванню","","",""  ],
        ["5","Обласне бюро судово-медичної експертизи","21012, м. Вінниця, вул. Г. Успенського, 83","(0432) 55-28-70","Древицький Олександр Іванович","sme_oblvin@mail.ru","Не підлягає ліцензуванню","","",""  ],
        ["6","Вінницьке обласне патологоанатомічне бюро","21018, м. Вінниця, вул. Пирогова, 46, корпус № 2 ","(0432) 67-00-68","Холод Любов Павлівна","vopab_vinn@ukr.net","23.04.2015","АЕ №638623","",""  ],
        ["7","Вінницький обласний центр медико-соціальної експертизи ","21029 м.Вінниця, вул. Хмельницьке шосе,92","(0432) 69-70-41","Костенко Ігор Миколайович","vinnmsek@ukr.net","18.05.2009-18.05.2014","АВ №471316","",""  ],
        ["8","Обласна спецмедбаза","21036 м. Вінниця., вул. Писарєва, 23","","Манжуловський Олександр Феофанович","","","","",""  ]
    ],
    [
        ["1","Вінницький медичний коледж ім. акад. Д.К. Заболотного","21037 м. Вінниця, вул. Пирогова, 57","(0432) 35-34-90","Андрієвський Іван Юрійович","vinmedkollege@mail.ru www.vmc.vn.ua","","","",""  ],
        ["2","Бершадський медичний коледж","24400 Вінницька обл., м.Бершадь, вул. Червоноармійська, 167","(04352) 2-86-12","Оніщенко Катерина Миколаївна","bmu2004@rambler.ru","","","",""  ],
        ["3","Гайсинський медичний коледж","23700, Вінницька обл. м. Гайсин вул. Б. Хмельницького,46","(04334) 2-14-03","Саблук Анатолій Григорович","gaisin_medcoll@ukr.net","","","",""  ],
        ["4","Могилів-Подільський медичний коледж","24000, м.Могилів-Подільський, Вінницької обл. вул. Сагайдачного, 6","(04337) 6-54-92","Кордон Володимир Михайлович","mogpodmedcollege@ukr.net","","","",""  ],
        ["5","Обласний центр післядипломної освіти медичних працівників","21050, м.Вінниця, вул. Грушевського, 2","(0432) 35-06-67","Кириченко Вікторія Іванівна","","","","",""  ],
        ["6","Науково-медична бібліотека","21018, м.Вінниця, вул. Льва Толстого,11","(0432) 35-06-53","Берладин Галина Василівна","vin.medbiblioteka@i.ua","","","",""  ]
    ]
  ]

Admin::MedicalSetupsGroup.delete_all
Admin::MedicalSetup.delete_all
medical_sc = []
medical_s = []
msc_i = 0

@m_s_g.each do |i|
  medical_sc[msc_i] = Admin::MedicalSetupsGroup.create(name: i)
  ms_i = 0
  @m_s[msc_i].each do |k|
    medical_s[ms_i] = Admin::MedicalSetup.create(name: k[1], address: k[2], phone: k[3], head_doctor: k[4],
                                       email: k[5], date_start: k[6], number_license: k[7], date_finish: k[8],
                                       medical_level: k[9], admin_medical_setup_category_id: medical_sc[msc_i].id)
    # puts "MS -  #{medical_s[ms_i.admin_medical_setup_category]}"
    # medical_s[ms_i].admin_medical_setup_category_id = medical_sc[msc_i]
    # medical_sc[msc_i].admin_medical_setups << medical_s[ms_i]
    ms_i = ms_i +1
  end
  msc_i = msc_i +1
end

# User.delete_all
# u1 = User.create(name: "Admin", email: "33admin44@gmail.com", password: "987789", password_confirmation: "987789")
# u2 = User.create(name: "Manager", email: "33manager44@gmail.com", password: "876678", password_confirmation: "876678")
# u3 = User.create(name: "User", email: "33user44@gmail.com", password: "765567", password_confirmation: "765567")
#
# Role.delete_all
# r1 = Role.create(title: "admin", type_role: 0, parents: [r1] )
# r2 = Role.create(title: "manager", type_role: 0, parents: [r1])
# r3 = Role.create(title: "user", type_role: 0, parents: [r2])
# r4 = Role.create(title: "admin/newsindex", type_role: 1, parents: [r2])
# r5 = Role.create(title: "admin/newsshow", type_role: 1, parents: [r2])
# r6 = Role.create(title: "admin/newsnew", type_role: 1, parents: [r2])
# r7 = Role.create(title: "admin/newscreate", type_role: 1, parents: [r2])
# r8 = Role.create(title: "admin/newsedit", type_role: 1, parents: [r2])
# r9 = Role.create(title: "admin/newsupdate", type_role: 1, parents: [r2])
# r10 = Role.create(title: "admin/newsdelete", type_role: 1, parents: [r2])

# User.delete_all
# u1 = User.create(name: "Admin", email: "33admin44@gmail.com", password: "987789", password_confirmation: "987789")
# u2 = User.create(name: "Manager", email: "33manager44@gmail.com", password: "876678", password_confirmation: "876678")
# u3 = User.create(name: "User", email: "33user44@gmail.com", password: "765567", password_confirmation: "765567")
#
# Role.delete_all
# r1 = Role.create(title: "admin", type_role: 0, parent_id: 0)
# r2 = Role.create(title: "manager", type_role: 0, parent_id: r1.id )
# r3 = Role.create(title: "user", type_role: 0, parent_id: r2.id)
# r4 = Role.create(title: "admin/newsindex", type_role: 1, parent_id: r2.id)
# r5 = Role.create(title: "admin/newsshow", type_role: 1, parent_id: r2.id)
# r6 = Role.create(title: "admin/newsnew", type_role: 1, parent_id: r2.id)
# r7 = Role.create(title: "admin/newscreate", type_role: 1, parent_id: r2.id)
# r8 = Role.create(title: "admin/newsedit", type_role: 1, parent_id: r2.id)
# r9 = Role.create(title: "admin/newsupdate", type_role: 1, parent_id: r2.id)
# r10 = Role.create(title: "admin/newsdelete", type_role: 1, parent_id: r2.id)
#
# # UserRole.delete_all
# u1.roles << [r1]
# u2.roles << [r2]
# u3.roles << [r3]

# MenuItem.delete_all
# m1 = MenuItem.create(title: "Департамент охорони здоров'я", type_level: "Заголовок меню", type_item: "Головне меню",
#                      parent_id: 0, link: "", show: true, order_item: 1)
# m5 = MenuItem.create(title: "Про департамент", type_level: "Перший рівень", type_item: "Головне меню",
#                      parent_id: m1.id, link: "http://www.vin.gov.ua/web/upravlinnya/web_upr_zdor.nsf/webgr_view/main?OpenDocument&count=15&RestrictToCategory=GrA9ALH", show: true, order_item: 1)
# m6 = MenuItem.create(title: "Структура", type_level: "Перший рівень", type_item: "Головне меню",
#                      parent_id: m1.id, link: "/structure", show: true, order_item: 2)
# m7 = MenuItem.create(title: "Працівники ДОЗ", type_level: "Перший рівень", type_item: "Головне меню",
#                      parent_id: m1.id, link: "", show: true, order_item: 3)
# m8 = MenuItem.create(title: "Графік прийому громадян", type_level: "Перший рівень", type_item: "Головне меню",
#                      parent_id: m1.id, link: "/schedule", show: true, order_item: 4)
# m9 = MenuItem.create(title: "Головні позаштатні спеціалісти ДОЗ", type_level: "Перший рівень", type_item: "Головне меню",
#                      parent_id: m1.id, link: "", show: true, order_item: 5)
#
# m2 = MenuItem.create(title: "Медичні заклади", type_level: "Заголовок меню", type_item: "Головне меню",
#                      parent_id: 0, link: "", show: true, order_item: 2)
# m10 = MenuItem.create(title: "Первинного рівня", type_level: "Перший рівень", type_item: "Головне меню",
#                      parent_id: m2.id, link: "", show: true, order_item: 1)
# m11 = MenuItem.create(title: "Вторинного рівня (спеціалізовані)", type_level: "Перший рівень", type_item: "Головне меню",
#                      parent_id: m2.id, link: "", show: true, order_item: 2)
# m12 = MenuItem.create(title: "Третинного рівня  (високоспеціалізовані)", type_level: "Перший рівень", type_item: "Головне меню",
#                      parent_id: m2.id, link: "", show: true, order_item: 3)
# m13 = MenuItem.create(title: "Санаторії", type_level: "Перший рівень", type_item: "Головне меню",
#                      parent_id: m2.id, link: "", show: true, order_item: 4)
# m14 = MenuItem.create(title: "Швидка медична допомога", type_level: "Перший рівень", type_item: "Головне меню",
#                      parent_id: m2.id, link: "", show: true, order_item: 5)
# m15 = MenuItem.create(title: "Будинки дитини", type_level: "Перший рівень", type_item: "Головне меню",
#                      parent_id: m2.id, link: "", show: true, order_item: 6)
#
# m3 = MenuItem.create(title: "Нормативна база", type_level: "Заголовок меню", type_item: "Головне меню",
#                      parent_id: 0, link: "", show: true, order_item: 3)
# m16 = MenuItem.create(title: "Нормативна база МОЗ", type_level: "Перший рівень", type_item: "Головне меню",
#                       parent_id: m3.id, link: "http://moz.gov.ua/ua/portal/publrel_standbase.html", show: true, order_item: 1)
# m17 = MenuItem.create(title: "Програми", type_level: "Перший рівень", type_item: "Головне меню",
#                       parent_id: m3.id, link: "http://www.vin.gov.ua/web/upravlinnya/web_upr_zdor.nsf/webgr_view/GrNVGFM?OpenDocument&count=5&RestrictToCategory=GrNVGFM", show: true, order_item: 2)
# m18 = MenuItem.create(title: "Розпорядження голови ОДА", type_level: "Перший рівень", type_item: "Головне меню",
#                       parent_id: m3.id, link: "http://www.vin.gov.ua/web/vinoda.nsf/webgr_view/Gr68F7P?OpenDocument&count=5&RestrictToCategory=Gr68F7P", show: true, order_item: 3)
# m19 = MenuItem.create(title: "Рішення обласної Ради", type_level: "Перший рівень", type_item: "Головне меню",
#                       parent_id: m3.id, link: "http://www.vinrada.gov.ua/proekti_rishen.htm", show: true, order_item: 4)
# m20 = MenuItem.create(title: "Накази ДОЗ", type_level: "Перший рівень", type_item: "Головне меню",
#                       parent_id: m3.id, link: "", show: true, order_item: 5)
# m21 = MenuItem.create(title: "Рішення засідань колегії ДОЗ", type_level: "Перший рівень", type_item: "Головне меню",
#                       parent_id: m3.id, link: "", show: true, order_item: 6)
# m22 = MenuItem.create(title: "План роботи ДОЗ", type_level: "Перший рівень", type_item: "Головне меню",
#                       parent_id: m3.id, link: "", show: true, order_item: 7)
# m23 = MenuItem.create(title: "Комплексний план", type_level: "Додатковий рівень", type_item: "Головне меню",
#                       parent_id: m22.id, link: "", show: true, order_item: 1)
# m24 = MenuItem.create(title: "План роботи на місяць", type_level: "Додатковий рівень", type_item: "Головне меню",
#                       parent_id: m22.id, link: "", show: true, order_item: 2)
#
#
# m4 = MenuItem.create(title: "Контакти", type_level: "Пункт меню", type_item: "Головне меню",
#                      parent_id: 0, link: "#contacts", show: true, order_item: 4)
#
#
# # MenuItem.delete_all
#
#
# r_m1 = MenuItem.create(title: "Основні показники діяльності охорони здоров'я", type_level: "Пункт меню", type_item: "Бокове меню",
#                      parent_id: 0, link: "", show: true, order_item: 1)
#
# r_m2 = MenuItem.create(title: "Впровадження сучасних методик та технологій", type_level: "Заголовок меню", type_item: "Бокове меню",
#                        parent_id: 0, link: "", show: true, order_item: 2)
# r_m2_1 = MenuItem.create(title: "Реєстр методичних рекомендацій, інформаційних листів (ІАЦМС)", type_level: "Перший рівень", type_item: "Бокове меню",
#                      parent_id: r_m2.id, link: "", show: true, order_item: 1)
# r_m2_2 = MenuItem.create(title: "Інформаційний бюлетень", type_level: "Перший рівень", type_item: "Бокове меню",
#                          parent_id: r_m2.id, link: "http://www.amnu.gov.ua/index.php?p=articles&action=displayarticle&id=83", show: true, order_item: 2)
#
# r_m3 = MenuItem.create(title: "Акредитація закладів охорони здоров'я", type_level: "Заголовок меню", type_item: "Бокове меню",
#                        parent_id: 0, link: "", show: true, order_item: 3)
# r_m3_1 = MenuItem.create(title: "Нормативна база", type_level: "Перший рівень", type_item: "Бокове меню",
#                          parent_id: r_m3.id, link: "", show: true, order_item: 1)
# r_m3_2 = MenuItem.create(title: "Плани та виконання", type_level: "Перший рівень", type_item: "Бокове меню",
#                          parent_id: r_m3.id, link: "", show: true, order_item: 2)
#
# r_m4 = MenuItem.create(title: "Державні закупівлі", type_level: "Заголовок меню", type_item: "Бокове меню",
#                        parent_id: 0, link: "#", show: true, order_item: 4)
# r_m4_1 = MenuItem.create(title: "2014 рік", type_level: "Перший рівень", type_item: "Бокове меню",
#                          parent_id: r_m4.id, link: "#", show: true, order_item: 1)
# r_m4_2 = MenuItem.create(title: "2015 рік", type_level: "Перший рівень", type_item: "Бокове меню",
#                          parent_id: r_m4.id, link: "#", show: true, order_item: 2)
# r_m4_3 = MenuItem.create(title: "Перелік закуплених лікарських засобів ДПЗ", type_level: "Перший рівень", type_item: "Бокове меню",
#                          parent_id: r_m4.id, link: "#", show: true, order_item: 3)
# r_m4_4 = MenuItem.create(title: "Забезпеченість за кошти державного бюджету", type_level: "Перший рівень", type_item: "Бокове меню",
#                          parent_id: r_m4.id, link: "#", show: true, order_item: 4)
# r_m4_5 = MenuItem.create(title: "Забезпеченість за іншими джерелами фінансування", type_level: "Перший рівень", type_item: "Бокове меню",
#                          parent_id: r_m4.id, link: "#", show: true, order_item: 5)
#
# r_m5 = MenuItem.create(title: "Бібліотека", type_level: "Пункт меню", type_item: "Бокове меню",
#                        parent_id: 0, link: "http://vinmedlib.org.ua/", show: true, order_item: 5)
#
# r_m6 = MenuItem.create(title: "Про створення ЄСЕМД в області", type_level: "Пункт меню", type_item: "Бокове меню",
#                        parent_id: 0, link: "http://www.content.net.ua/registration/index.php?id=5915", show: true, order_item: 6)
#
# r_m7 = MenuItem.create(title: "Національна лінія телефону довіри", type_level: "Заголовок меню", type_item: "Бокове меню",
#                        parent_id: 0, link: "#", show: true, order_item: 7)
# r_m7_1 = MenuItem.create(title: "ВІЛ/СНІД", type_level: "Перший рівень", type_item: "Бокове меню",
#                          parent_id: r_m7.id, link: "http://aidscenter.org/", show: true, order_item: 1)
# r_m7_2 = MenuItem.create(title: "Електронна приймальня для пацієнтів", type_level: "Перший рівень", type_item: "Бокове меню",
#                          parent_id: r_m7.id, link: "http://dssz.gov.ua/index.php/?option=com_content&view=article&id=1551:sendform&catid=475:othe", show: true, order_item: 2)
#
# r_m8 = MenuItem.create(title: "Волонтерство", type_level: "Заголовок меню", type_item: "Бокове меню",
#                        parent_id: 0, link: "#", show: true, order_item: 8)
# r_m8_1 = MenuItem.create(title: "Допомога учасникам бойових дій", type_level: "Перший рівень", type_item: "Бокове меню",
#                          parent_id: r_m8.id, link: "http://aidscenter.org/", show: true, order_item: 1)
# r_m8_2 = MenuItem.create(title: "Волонтерські організації", type_level: "Перший рівень", type_item: "Бокове меню",
#                          parent_id: r_m8.id, link: "#", show: true, order_item: 2)
# r_m8_3 = MenuItem.create(title: "Благодійність", type_level: "Перший рівень", type_item: "Бокове меню",
#                          parent_id: r_m8.id, link: "#", show: false, order_item: 3)
#
# r_m9 = MenuItem.create(title: "Соціальні проекти", type_level: "Пункт меню", type_item: "Бокове меню",
#                        parent_id: 0, link: "http://www.content.net.ua/registration/index.php?id=5915", show: true, order_item: 9)
#
# r_m10 = MenuItem.create(title: "Фотоматеріали", type_level: "Пункт меню", type_item: "Бокове меню",
#                        parent_id: 0, link: "http://www.content.net.ua/registration/index.php?id=5915", show: true, order_item: 10)
#
# r_m11 = MenuItem.create(title: "Відеоматеріали", type_level: "Пункт меню", type_item: "Бокове меню",
#                        parent_id: 0, link: "http://www.content.net.ua/registration/index.php?id=5915", show: true, order_item: 11)
#
# r_m12 = MenuItem.create(title: "Гаряча лінія", type_level: "Заголовок меню", type_item: "Бокове меню",
#                        parent_id: 0, link: "#", show: true, order_item: 12)
# r_m12_1 = MenuItem.create(title: "Он-лайн допомога", type_level: "Перший рівень", type_item: "Бокове меню",
#                          parent_id: r_m12.id, link: "#", show: true, order_item: 1)
# r_m12_2 = MenuItem.create(title: "Цілодобова телефонна допомога", type_level: "Перший рівень", type_item: "Бокове меню",
#                          parent_id: r_m12.id, link: "#", show: true, order_item: 2)
# r_m12_3 = MenuItem.create(title: "Телефон довіри", type_level: "Перший рівень", type_item: "Бокове меню",
#                          parent_id: r_m12.id, link: "#", show: true, order_item: 3)
# r_m12_4 = MenuItem.create(title: "Гаряча лінія з питань реформування охорони здоров`я", type_level: "Перший рівень", type_item: "Бокове меню",
#                          parent_id: r_m12.id, link: "#", show: true, order_item: 4)
# r_m12_5 = MenuItem.create(title: "Гаряча лінія З метою забезпечення оперативного реагування на звернення громадян в МОЗ", type_level: "Перший рівень", type_item: "Бокове меню",
#                          parent_id: r_m12.id, link: "#", show: true, order_item: 5)
# r_m12_6 = MenuItem.create(title: "Гаряча лінія з питань роботи екстреної медичної допомоги та медицини катастроф", type_level: "Перший рівень", type_item: "Бокове меню",
#                           parent_id: r_m12.id, link: "#", show: true, order_item: 6)
# r_m12_7 = MenuItem.create(title: "Гаряча лінія «АНТИ-ГРИП»", type_level: "Перший рівень", type_item: "Бокове меню",
#                           parent_id: r_m12.id, link: "#", show: true, order_item: 7)
# r_m12_8 = MenuItem.create(title: "Прес-центр", type_level: "Перший рівень", type_item: "Бокове меню",
#                           parent_id: r_m12.id, link: "#", show: true, order_item: 8)
# r_m12_8_1 = MenuItem.create(title: "Повідомлення та заяви", type_level: "Додатковий рівень", type_item: "Бокове меню",
#                       parent_id: r_m12_8.id, link: "http://aidscenter.org/", show: true, order_item: 1)
# r_m12_8_2 = MenuItem.create(title: "Реагування на критику", type_level: "Додатковий рівень", type_item: "Бокове меню",
#                       parent_id: r_m12_8.id, link: "http://aidscenter.org/", show: true, order_item: 2)
# r_m12_8_2 = MenuItem.create(title: "Форма та порядок подання", type_level: "Додатковий рівень", type_item: "Бокове меню",
#                       parent_id: r_m12_8.id, link: "http://aidscenter.org/", show: true, order_item: 3)
# r_m12_9 = MenuItem.create(title: "Звернення громадян.  Інформаційний куточок", type_level: "Перший рівень", type_item: "Бокове меню",
#                           parent_id: r_m12.id, link: "#", show: true, order_item: 9)
#
# r_m13 = MenuItem.create(title: "Здоровий спосіб життя", type_level: "Заголовок меню", type_item: "Бокове меню",
#                        parent_id: 0, link: "#", show: true, order_item: 13)
# r_m13_1 = MenuItem.create(title: "Здорове життя (бюлетені, Пам'ятка для тих, хто здійснює санітарно-просвітницьку роботу)", type_level: "Перший рівень", type_item: "Бокове меню",
#                          parent_id: r_m13.id, link: "http://aidscenter.org/", show: true, order_item: 1)
# r_m13_2 = MenuItem.create(title: "Блок громадського здоров’я", type_level: "Перший рівень", type_item: "Бокове меню",
#                          parent_id: r_m13.id, link: "http://dssz.gov.ua/index.php/?option=com_content&view=article&id=1551:sendform&catid=475:othe", show: true, order_item: 2)
#
#
# r_m14 = MenuItem.create(title: "Публічна інформація", type_level: "Пункт меню", type_item: "Бокове меню",
#                        parent_id: 0, link: "#", show: true, order_item: 14)
#
# r_m15 = MenuItem.create(title: "Державно-приватне партнерство", type_level: "Пункт меню", type_item: "Бокове меню",
#                        parent_id: 0, link: "#", show: true, order_item: 15)



# --- New seeds ---
# Admin::User.delete_all
# a_u1 = Admin::User.create(name: "Admin", email: "33admin44@gmail.com", password: "987789", password_confirmation: "987789")
# a_u2 = Admin::User.create(name: "Manager", email: "33manager44@gmail.com", password: "876678", password_confirmation: "876678")
# a_u3 = Admin::User.create(name: "User", email: "33user44@gmail.com", password: "765567", password_confirmation: "765567")
#
# Admin::Role.delete_all
# a_r1 = Admin::Role.create(title: "admin", type_role: 0, parent_id: 0)
# a_r2 = Admin::Role.create(title: "manager", type_role: 0, parent_id: a_r1.id)
# a_r3 = Admin::Role.create(title: "user", type_role: 0, parent_id: a_r2.id)
# a_r4 = Admin::Role.create(title: "admin/newsindex", type_role: 1, parent_id: a_r2.id)
# a_r5 = Admin::Role.create(title: "admin/newsshow", type_role: 1, parent_id: a_r2.id)
# a_r6 = Admin::Role.create(title: "admin/newsnew", type_role: 1, parent_id: a_r2.id)
# a_r7 = Admin::Role.create(title: "admin/newscreate", type_role: 1, parent_id: a_r2.id)
# a_r8 = Admin::Role.create(title: "admin/newsedit", type_role: 1, parent_id: a_r2.id)
# a_r9 = Admin::Role.create(title: "admin/newsupdate", type_role: 1, parent_id: a_r2.id)
# a_r10 = Admin::Role.create(title: "admin/newsdelete", type_role: 1, parent_id: a_r2.id)
#
# a_u1.admin_roles << [a_r1]
# a_u2.admin_roles << [a_r2]
# a_u3.admin_roles << [a_r3]



# Admin::MenuItem.delete_all
# m1 = Admin::MenuItem.create(title: "Департамент охорони здоров'я", type_level: "Заголовок меню", type_item: "Головне меню",
#                      parent_id: 0, link: "", show: true, order_item: 1)
# m5 = Admin::MenuItem.create(title: "Про департамент", type_level: "Перший рівень", type_item: "Головне меню",
#                      parent_id: m1.id, link: "http://www.vin.gov.ua/web/upravlinnya/web_upr_zdor.nsf/webgr_view/main?OpenDocument&count=15&RestrictToCategory=GrA9ALH", show: true, order_item: 1)
# m6 = Admin::MenuItem.create(title: "Структура", type_level: "Перший рівень", type_item: "Головне меню",
#                      parent_id: m1.id, link: "/structure", show: true, order_item: 2)
# m7 = Admin::MenuItem.create(title: "Працівники ДОЗ", type_level: "Перший рівень", type_item: "Головне меню",
#                      parent_id: m1.id, link: "", show: true, order_item: 3)
# m8 = Admin::MenuItem.create(title: "Графік прийому громадян", type_level: "Перший рівень", type_item: "Головне меню",
#                      parent_id: m1.id, link: "/schedule", show: true, order_item: 4)
# m9 = Admin::MenuItem.create(title: "Головні позаштатні спеціалісти ДОЗ", type_level: "Перший рівень", type_item: "Головне меню",
#                      parent_id: m1.id, link: "", show: true, order_item: 5)
#
# m2 = Admin::MenuItem.create(title: "Медичні заклади", type_level: "Заголовок меню", type_item: "Головне меню",
#                      parent_id: 0, link: "", show: true, order_item: 2)
# m10 = Admin::MenuItem.create(title: "Первинного рівня", type_level: "Перший рівень", type_item: "Головне меню",
#                      parent_id: m2.id, link: "", show: true, order_item: 1)
# m11 = Admin::MenuItem.create(title: "Вторинного рівня (спеціалізовані)", type_level: "Перший рівень", type_item: "Головне меню",
#                      parent_id: m2.id, link: "", show: true, order_item: 2)
# m12 = Admin::MenuItem.create(title: "Третинного рівня  (високоспеціалізовані)", type_level: "Перший рівень", type_item: "Головне меню",
#                      parent_id: m2.id, link: "", show: true, order_item: 3)
# m13 = Admin::MenuItem.create(title: "Санаторії", type_level: "Перший рівень", type_item: "Головне меню",
#                      parent_id: m2.id, link: "", show: true, order_item: 4)
# m14 = Admin::MenuItem.create(title: "Швидка медична допомога", type_level: "Перший рівень", type_item: "Головне меню",
#                      parent_id: m2.id, link: "", show: true, order_item: 5)
# m15 = Admin::MenuItem.create(title: "Будинки дитини", type_level: "Перший рівень", type_item: "Головне меню",
#                      parent_id: m2.id, link: "", show: true, order_item: 6)
#
# m3 = Admin::MenuItem.create(title: "Нормативна база", type_level: "Заголовок меню", type_item: "Головне меню",
#                      parent_id: 0, link: "", show: true, order_item: 3)
# m16 = Admin::MenuItem.create(title: "Нормативна база МОЗ", type_level: "Перший рівень", type_item: "Головне меню",
#                       parent_id: m3.id, link: "http://moz.gov.ua/ua/portal/publrel_standbase.html", show: true, order_item: 1)
# m17 = Admin::MenuItem.create(title: "Програми", type_level: "Перший рівень", type_item: "Головне меню",
#                       parent_id: m3.id, link: "http://www.vin.gov.ua/web/upravlinnya/web_upr_zdor.nsf/webgr_view/GrNVGFM?OpenDocument&count=5&RestrictToCategory=GrNVGFM", show: true, order_item: 2)
# m18 = Admin::MenuItem.create(title: "Розпорядження голови ОДА", type_level: "Перший рівень", type_item: "Головне меню",
#                       parent_id: m3.id, link: "http://www.vin.gov.ua/web/vinoda.nsf/webgr_view/Gr68F7P?OpenDocument&count=5&RestrictToCategory=Gr68F7P", show: true, order_item: 3)
# m19 = Admin::MenuItem.create(title: "Рішення обласної Ради", type_level: "Перший рівень", type_item: "Головне меню",
#                       parent_id: m3.id, link: "http://www.vinrada.gov.ua/proekti_rishen.htm", show: true, order_item: 4)
# m20 = Admin::MenuItem.create(title: "Накази ДОЗ", type_level: "Перший рівень", type_item: "Головне меню",
#                       parent_id: m3.id, link: "", show: true, order_item: 5)
# m21 = Admin::MenuItem.create(title: "Рішення засідань колегії ДОЗ", type_level: "Перший рівень", type_item: "Головне меню",
#                       parent_id: m3.id, link: "", show: true, order_item: 6)
# m22 = Admin::MenuItem.create(title: "План роботи ДОЗ", type_level: "Перший рівень", type_item: "Головне меню",
#                       parent_id: m3.id, link: "", show: true, order_item: 7)
# m23 = Admin::MenuItem.create(title: "Комплексний план", type_level: "Додатковий рівень", type_item: "Головне меню",
#                       parent_id: m22.id, link: "", show: true, order_item: 1)
# m24 = Admin::MenuItem.create(title: "План роботи на місяць", type_level: "Додатковий рівень", type_item: "Головне меню",
#                       parent_id: m22.id, link: "", show: true, order_item: 2)
#
#
# m4 = Admin::MenuItem.create(title: "Контакти", type_level: "Пункт меню", type_item: "Головне меню",
#                      parent_id: 0, link: "#contacts", show: true, order_item: 4)
#
#
# # MenuItem.delete_all
#
#
# r_m1 = Admin::MenuItem.create(title: "Основні показники діяльності охорони здоров'я", type_level: "Пункт меню", type_item: "Бокове меню",
#                      parent_id: 0, link: "", show: true, order_item: 1)
#
# r_m2 = Admin::MenuItem.create(title: "Впровадження сучасних методик та технологій", type_level: "Заголовок меню", type_item: "Бокове меню",
#                        parent_id: 0, link: "", show: true, order_item: 2)
# r_m2_1 = Admin::MenuItem.create(title: "Реєстр методичних рекомендацій, інформаційних листів (ІАЦМС)", type_level: "Перший рівень", type_item: "Бокове меню",
#                      parent_id: r_m2.id, link: "", show: true, order_item: 1)
# r_m2_2 = Admin::MenuItem.create(title: "Інформаційний бюлетень", type_level: "Перший рівень", type_item: "Бокове меню",
#                          parent_id: r_m2.id, link: "http://www.amnu.gov.ua/index.php?p=articles&action=displayarticle&id=83", show: true, order_item: 2)
#
# r_m3 = Admin::MenuItem.create(title: "Акредитація закладів охорони здоров'я", type_level: "Заголовок меню", type_item: "Бокове меню",
#                        parent_id: 0, link: "", show: true, order_item: 3)
# r_m3_1 = Admin::MenuItem.create(title: "Нормативна база", type_level: "Перший рівень", type_item: "Бокове меню",
#                          parent_id: r_m3.id, link: "", show: true, order_item: 1)
# r_m3_2 = Admin::MenuItem.create(title: "Плани та виконання", type_level: "Перший рівень", type_item: "Бокове меню",
#                          parent_id: r_m3.id, link: "", show: true, order_item: 2)
#
# r_m4 = Admin::MenuItem.create(title: "Державні закупівлі", type_level: "Заголовок меню", type_item: "Бокове меню",
#                        parent_id: 0, link: "#", show: true, order_item: 4)
# r_m4_1 = Admin::MenuItem.create(title: "2014 рік", type_level: "Перший рівень", type_item: "Бокове меню",
#                          parent_id: r_m4.id, link: "#", show: true, order_item: 1)
# r_m4_2 = Admin::MenuItem.create(title: "2015 рік", type_level: "Перший рівень", type_item: "Бокове меню",
#                          parent_id: r_m4.id, link: "#", show: true, order_item: 2)
# r_m4_3 = Admin::MenuItem.create(title: "Перелік закуплених лікарських засобів ДПЗ", type_level: "Перший рівень", type_item: "Бокове меню",
#                          parent_id: r_m4.id, link: "#", show: true, order_item: 3)
# r_m4_4 = Admin::MenuItem.create(title: "Забезпеченість за кошти державного бюджету", type_level: "Перший рівень", type_item: "Бокове меню",
#                          parent_id: r_m4.id, link: "#", show: true, order_item: 4)
# r_m4_5 = Admin::MenuItem.create(title: "Забезпеченість за іншими джерелами фінансування", type_level: "Перший рівень", type_item: "Бокове меню",
#                          parent_id: r_m4.id, link: "#", show: true, order_item: 5)
#
# r_m5 = Admin::MenuItem.create(title: "Бібліотека", type_level: "Пункт меню", type_item: "Бокове меню",
#                        parent_id: 0, link: "http://vinmedlib.org.ua/", show: true, order_item: 5)
#
# r_m6 = Admin::MenuItem.create(title: "Про створення ЄСЕМД в області", type_level: "Пункт меню", type_item: "Бокове меню",
#                        parent_id: 0, link: "http://www.content.net.ua/registration/index.php?id=5915", show: true, order_item: 6)
#
# r_m7 = Admin::MenuItem.create(title: "Національна лінія телефону довіри", type_level: "Заголовок меню", type_item: "Бокове меню",
#                        parent_id: 0, link: "#", show: true, order_item: 7)
# r_m7_1 = Admin::MenuItem.create(title: "ВІЛ/СНІД", type_level: "Перший рівень", type_item: "Бокове меню",
#                          parent_id: r_m7.id, link: "http://aidscenter.org/", show: true, order_item: 1)
# r_m7_2 = Admin::MenuItem.create(title: "Електронна приймальня для пацієнтів", type_level: "Перший рівень", type_item: "Бокове меню",
#                          parent_id: r_m7.id, link: "http://dssz.gov.ua/index.php/?option=com_content&view=article&id=1551:sendform&catid=475:othe", show: true, order_item: 2)
#
# r_m8 = Admin::MenuItem.create(title: "Волонтерство", type_level: "Заголовок меню", type_item: "Бокове меню",
#                        parent_id: 0, link: "#", show: true, order_item: 8)
# r_m8_1 = Admin::MenuItem.create(title: "Допомога учасникам бойових дій", type_level: "Перший рівень", type_item: "Бокове меню",
#                          parent_id: r_m8.id, link: "http://aidscenter.org/", show: true, order_item: 1)
# r_m8_2 = Admin::MenuItem.create(title: "Волонтерські організації", type_level: "Перший рівень", type_item: "Бокове меню",
#                          parent_id: r_m8.id, link: "#", show: true, order_item: 2)
# r_m8_3 = Admin::MenuItem.create(title: "Благодійність", type_level: "Перший рівень", type_item: "Бокове меню",
#                          parent_id: r_m8.id, link: "#", show: false, order_item: 3)
#
# r_m9 = Admin::MenuItem.create(title: "Соціальні проекти", type_level: "Пункт меню", type_item: "Бокове меню",
#                        parent_id: 0, link: "http://www.content.net.ua/registration/index.php?id=5915", show: true, order_item: 9)
#
# r_m10 = Admin::MenuItem.create(title: "Фотоматеріали", type_level: "Пункт меню", type_item: "Бокове меню",
#                        parent_id: 0, link: "http://www.content.net.ua/registration/index.php?id=5915", show: true, order_item: 10)
#
# r_m11 = Admin::MenuItem.create(title: "Відеоматеріали", type_level: "Пункт меню", type_item: "Бокове меню",
#                        parent_id: 0, link: "http://www.content.net.ua/registration/index.php?id=5915", show: true, order_item: 11)
#
# r_m12 = Admin::MenuItem.create(title: "Гаряча лінія", type_level: "Заголовок меню", type_item: "Бокове меню",
#                        parent_id: 0, link: "#", show: true, order_item: 12)
# r_m12_1 = Admin::MenuItem.create(title: "Он-лайн допомога", type_level: "Перший рівень", type_item: "Бокове меню",
#                          parent_id: r_m12.id, link: "#", show: true, order_item: 1)
# r_m12_2 = Admin::MenuItem.create(title: "Цілодобова телефонна допомога", type_level: "Перший рівень", type_item: "Бокове меню",
#                          parent_id: r_m12.id, link: "#", show: true, order_item: 2)
# r_m12_3 = Admin::MenuItem.create(title: "Телефон довіри", type_level: "Перший рівень", type_item: "Бокове меню",
#                          parent_id: r_m12.id, link: "#", show: true, order_item: 3)
# r_m12_4 = Admin::MenuItem.create(title: "Гаряча лінія з питань реформування охорони здоров`я", type_level: "Перший рівень", type_item: "Бокове меню",
#                          parent_id: r_m12.id, link: "#", show: true, order_item: 4)
# r_m12_5 = Admin::MenuItem.create(title: "Гаряча лінія З метою забезпечення оперативного реагування на звернення громадян в МОЗ", type_level: "Перший рівень", type_item: "Бокове меню",
#                          parent_id: r_m12.id, link: "#", show: true, order_item: 5)
# r_m12_6 = Admin::MenuItem.create(title: "Гаряча лінія з питань роботи екстреної медичної допомоги та медицини катастроф", type_level: "Перший рівень", type_item: "Бокове меню",
#                           parent_id: r_m12.id, link: "#", show: true, order_item: 6)
# r_m12_7 = Admin::MenuItem.create(title: "Гаряча лінія «АНТИ-ГРИП»", type_level: "Перший рівень", type_item: "Бокове меню",
#                           parent_id: r_m12.id, link: "#", show: true, order_item: 7)
# r_m12_8 = Admin::MenuItem.create(title: "Прес-центр", type_level: "Перший рівень", type_item: "Бокове меню",
#                           parent_id: r_m12.id, link: "#", show: true, order_item: 8)
# r_m12_8_1 = Admin::MenuItem.create(title: "Повідомлення та заяви", type_level: "Додатковий рівень", type_item: "Бокове меню",
#                       parent_id: r_m12_8.id, link: "http://aidscenter.org/", show: true, order_item: 1)
# r_m12_8_2 = Admin::MenuItem.create(title: "Реагування на критику", type_level: "Додатковий рівень", type_item: "Бокове меню",
#                       parent_id: r_m12_8.id, link: "http://aidscenter.org/", show: true, order_item: 2)
# r_m12_8_2 = Admin::MenuItem.create(title: "Форма та порядок подання", type_level: "Додатковий рівень", type_item: "Бокове меню",
#                       parent_id: r_m12_8.id, link: "http://aidscenter.org/", show: true, order_item: 3)
# r_m12_9 = Admin::MenuItem.create(title: "Звернення громадян.  Інформаційний куточок", type_level: "Перший рівень", type_item: "Бокове меню",
#                           parent_id: r_m12.id, link: "#", show: true, order_item: 9)
#
# r_m13 = Admin::MenuItem.create(title: "Здоровий спосіб життя", type_level: "Заголовок меню", type_item: "Бокове меню",
#                        parent_id: 0, link: "#", show: true, order_item: 13)
# r_m13_1 = Admin::MenuItem.create(title: "Здорове життя (бюлетені, Пам'ятка для тих, хто здійснює санітарно-просвітницьку роботу)", type_level: "Перший рівень", type_item: "Бокове меню",
#                          parent_id: r_m13.id, link: "http://aidscenter.org/", show: true, order_item: 1)
# r_m13_2 = Admin::MenuItem.create(title: "Блок громадського здоров’я", type_level: "Перший рівень", type_item: "Бокове меню",
#                          parent_id: r_m13.id, link: "http://dssz.gov.ua/index.php/?option=com_content&view=article&id=1551:sendform&catid=475:othe", show: true, order_item: 2)
#
#
# r_m14 = Admin::MenuItem.create(title: "Публічна інформація", type_level: "Пункт меню", type_item: "Бокове меню",
#                        parent_id: 0, link: "#", show: true, order_item: 14)
#
# r_m15 = Admin::MenuItem.create(title: "Державно-приватне партнерство", type_level: "Пункт меню", type_item: "Бокове меню",
#                        parent_id: 0, link: "#", show: true, order_item: 15)










# Admin::News.delete_all
# Admin::News.create(title: "Переохолодження!", pre_text: "Обережно, переохолодження та обмороження!",
#                    description: "До кінця тижня на Черкащині прогнозують пониження температури до 10 грудусів нижче нуля. У Департаменті охорони здоров'я Черкаської ОДА закликають жителів бути обережними та не переохолоджуватися.",
#                     publish_on: true, user_id: u1.id) #image: "news/child.jpg",
# Admin::News.create(title: "Захист від вірусів", pre_text: "Як слизові оболонки допоможуть захиститися від вірусів",
#                    description: "Аби віруси не потрапляли в організм, слизові оболонки слід оберігати від пересихання. Наступні прості поради допоможуть посилити захист від інфекцій.",
#                    publish_on: true, user_id: u2.id) #image: "news/woman.jpg",
# Admin::News.create(title: "Грип", pre_text: "Грип: поширення, симптоми, профілактика",
#                    description: "В Україні спостерігається значне підвищення рівня захворюваності на грип, близьке до епідемічного. МОЗ України наголошує на необхідності дотримання заходів задля попередження зараження грипом та у разі захворювання.",
#                    publish_on: true, user_id: u2.id) #image: "news/air.jpg",
# Admin::News.create(title: "Проба ополонки!", pre_text: "Обережно, переохолодження та обмороження!",
#                    description: "До кінця тижня на Черкащині прогнозують пониження температури до 10 грудусів нижче нуля. У Департаменті охорони здоров'я Черкаської ОДА закликають жителів бути обережними та не переохолоджуватися.",
#                    publish_on: true, user_id: u2.id) #image: "news/36.jpg",
# MedicalSetupsGroup.delete_all
# msc1 = MedicalSetupsGroup.create(name: "First category L1", type_category: "Location")
# msc2 = MedicalSetupsGroup.create(name: "First category L2", type_category: "Location")
# msc3 = MedicalSetupsGroup.create(name: "First category L3", type_category: "Location")
# msc4 = MedicalSetupsGroup.create(name: "Second category", type_category: "Other")
# msc5 = MedicalSetupsGroup.create(name: "Third category", type_category: "Study")
#
# MedicalSetup.delete_all
# ms1 = MedicalSetup.create(name: "Перший заклад 1 Location", address: "Апдреса перша 1", phone: "111 111 111",
#                           head_doctor: "Першиий Голова", email: "f111@g.com", category_level: "1", site_address: "http://www.cyberforum.ru/",
#                           medical_setup_category_id: msc1.id )
# ms2 = MedicalSetup.create(name: "Перший заклад 2 Location", address: "Апдреса перша 1", phone: "111 111 111",
#                           head_doctor: "Першиий Голова", email: "f111@g.com", category_level: "1", site_address: "http://www.cyberforum.ru/",
#                           medical_setup_category_id: msc2.id )
# ms3 = MedicalSetup.create(name: "Перший заклад 3 Location", address: "Апдреса перша 1", phone: "111 111 111",
#                           head_doctor: "Першиий Голова", email: "f111@g.com", category_level: "1", site_address: "http://www.cyberforum.ru/",
#                           medical_setup_category_id: msc3.id )
# ms4 = MedicalSetup.create(name: "Перший заклад 1", address: "Апдреса перша 1", phone: "111 111 111",
#                           head_doctor: "Першиий Голова", email: "f111@g.com", category_level: "1", site_address: "http://www.cyberforum.ru/",
#                           medical_setup_category_id: msc3.id )
# ms5 = MedicalSetup.create(name: "Перший заклад 1 Other", address: "Апдреса перша 1", phone: "111 111 111",
#                           head_doctor: "Першиий Голова", email: "f111@g.com", category_level: "1", site_address: "http://www.cyberforum.ru/",
#                           medical_setup_category_id: msc4.id )
# ms6 = MedicalSetup.create(name: "Перший заклад 1 Study", address: "Апдреса перша 1", phone: "111 111 111",
#                           head_doctor: "Першиий Голова", email: "f111@g.com", category_level: "1", site_address: "http://www.cyberforum.ru/",
#                           medical_setup_category_id: msc5.id )
#
# t1 = Time.now.strftime('%F')
# t2 = Time.now.change(year: 2018).strftime('%F')
#
# MedicalSetupLicense.delete_all
# msl1 = MedicalSetupLicense.create(date_start: t1, date_finish: t2, number_license: "AB 237194", medical_setup_id: ms1.id )
# msl2 = MedicalSetupLicense.create(date_start: t1, date_finish: t2, number_license: "AB 237194", medical_setup_id: ms2.id )
# msl3 = MedicalSetupLicense.create(date_start: t1, date_finish: t2, number_license: "AB 237194", medical_setup_id: ms3.id )
# msl4 = MedicalSetupLicense.create(date_start: t1, date_finish: t2, number_license: "AB 237194", medical_setup_id: ms4.id )
# msl5 = MedicalSetupLicense.create(date_start: t1, date_finish: t2, number_license: "AB 237194", medical_setup_id: ms5.id )
# msl6 = MedicalSetupLicense.create(date_start: t2, date_finish: t1, number_license: "AB 237194", medical_setup_id: ms6.id )